[
    {
        "title": "Waqf panel approves 14 amendments proposed by NDA members, rejects 44 by Oppn",
        "link": "https://indianexpress.com/article/political-pulse/waqf-panel-approves-amendments-nda-rejects-opposition-9801759/?ref=hometop_hp",
        "content": "The Joint Committee of Parliament examining the Waqf (Amendment) Bill, 2024, approved 14 amendments and rejected 44 others on Monday. The Indian Express has learnt that the 14 amendments approved were proposed by members of the ruling BJP and its National Democratic Alliance (NDA) allies, while the 44 rejected were from the Opposition side.\nSpeaking after the meeting on Monday, committee chairperson Jagdambika Pal said the amendments passed on Monday would result in a better Bill, and the objective of the government to give benefits to poor and Pasmanda Muslims will be fulfilled.\n“There was a meeting to discuss clause-by-clause consideration. All the amendments introduced by the Opposition – each 44 of them were read by me with their names. I asked them if they were moving their amendments. Then they were moved. It could not have been more democratic than this. If the amendments were moved, and there were 16 members voting against them, and only 10 in favour of them, then can those with 10 members supporting them be accepted? It is natural whether it is the Parliament or JPC,” said Pal.\nADVERTISEMENT\nPause\nUnmute\n:\nFullscreen\n“There were several things which they agreed to which they had opined on. Today, an amendment was passed – earlier it was the collector who was made the authority, but now the authority will be appointed by state government – whether it is commissioner or secretary,” added Pal.\nSTORIES YOU MAY LIKE\nDoctor kidnapped in Karnataka for Rs 6-crore ransom, let off with Rs 300 to return home\nMamta Kulkarni says she ‘can’t imagine doing films again’ after taking sanyas at Maha Kumbh\nWhen Rajesh Khanna called son-in-law Akshay Kumar 'hera-pheri wala aadmi', advised Twinkle to keep his leash tight\nThe Waqf panel has 31 members from both Houses of Parliament: 16 from the NDA, including 12 from the BJP; 13 from Opposition parties, one from YSR Congress Party, and one nominated member.\nSection 3C(2) of the proposed Bill, tabled in the Lok Sabha on August 8, 2024, sought to empower the government to decide if a property given as Waqf is government land. “If any question arises as to whether any such property is a Government property, the same shall be referred to the Collector having jurisdiction who shall make such inquiry as he deems fit, and determine whether such property is a Government property or not and submit his report to the State Government,” the proposed Bill had said. This provision essentially means that the collector — and not the Waqf Tribunal — will make this determination in case of a dispute.\nPal added: “(Another amendment) was regarding the composition of the (Waqf) Board. Earlier it had two members. From the government side, it was proposed that instead of two, there should be three members, including an Islamic scholar. They (Opposition) opposed that too. There was discussion for the entry of Waqf properties on the portal to be increased from six months.”\nADVERTISEMENT\nThe proposed Bill had proposed to change the composition of Waqf Boards in states. It had proposed to allow even a non-Muslim CEO and give the power to the state government to have at least two non-Muslim members to the state Waqf Boards."
    },
    {
        "title": "Delhi Elections 2025: Modi for PM, Kejriwal for CM, indifference for ‘Sheesh Mahal’",
        "link": "https://indianexpress.com/article/political-pulse/pm-modi-arvind-kejriwal-sheesh-mahal-delhi-assembly-polls-9801868/?ref=hometop_hp",
        "content": "Over the past 10 years, the Congress has launched numerous campaigns – ranging from “suit-boot ki sarkar” to “Chowkidar Chor Hai” (on the back of allegations of irregularities in the Rafale deal) – in an apparent bid to dim the carefully constructed halo of personal incorruptibility around Narendra Modi.\nHowever, irrespective of electoral wins or losses for the BJP in states and the party’s fortunes at the Centre, this charge of alleged corruption never stuck to Modi in the eyes of his supporters.\nIn the ongoing Delhi polls, the BJP seems to have run into a similar wall against Aam Aadmi Party supremo Arvind Kejriwal. It is the first election under the graft cloud for the former chief minister, who rose to power riding an anti-corruption movement.\nADVERTISEMENT\nPause\nUnmute\n:\nFullscreen\nHowever, the excise policy charges against Kejriwal, which landed him in jail, or the BJP’s high-pitch ‘Sheesh Mahal’ campaign accusing him of spending lavishly on the CM’s residence, don’t seem to be cutting much ice with AAP supporters on the ground.\nSTORIES YOU MAY LIKE\nWhen Rajesh Khanna called son-in-law Akshay Kumar 'hera-pheri wala aadmi', advised Twinkle to keep his leash tight\nAsha Bhosle's granddaughter Zanai, cricketer Mohammed Siraj address dating rumours\nHolocaust Memorial Day: The conflict of hope and horror in Anne Frank’s optimism\nThey either dismiss these charges as political, noting that “all parties are corrupt”, or don’t believe them at all.\nIt is only among the middle class that the issue finds some traction, with some voters saying they are shifting loyalties due to the allegations.\nAnother interesting facet of this AAP support base is that it is not necessarily in opposition to Narendra Modi. A large number of Kejriwal supporters are also Modi supporters. They would just choose them in different polls – Kejriwal for state, Modi for the country.\nADVERTISEMENT\n“Log Modi ji ko desh chalane dete hain, kyunki vo local kaam nahin hai. Vo desh ke liye hai. Yahan, local party ko jitaate hain (People let Modi ji run the country because that is not related to local issues. In Assembly polls, they vote for the local party)”: is a common argument given by voters.\n“His ministers may be corrupt, Kejriwal isn’t”; “Everybody makes money in politics, at least he is doing something”, “Kejriwal wants to do a lot for the people, his MLAs are failing him”; and “the Lieutenant Governor is not letting him do what he can” – are some common refrains among AAP supporters, particularly the poor, across Delhi.\nIn Kejriwal’s New Delhi constituency, where his rival Parvesh Verma of the BJP consistently brings up the ‘Sheesh Mahal’ issue, Om Prakash Gupta (75), a resident of the B R Camp near the Race Course Club, says: “The allegations of corruption don’t mean much to the public. They think, ‘Chaahe Kejriwal corrupt ho bhi, toh humara kaam toh chal raha hai… Suvidha to mil rahi hai (Even if Kejriwal is corrupt, our work is getting done… We are getting the facilities)’.”\nRamesh Kumar, a former pradhan of Nai Basti, a Dalit-dominated colony in Deoli constituency, shows sewage-filled streets around his house when asked about the work done by the AAP government. But he blames the AAP MLA for it, and not Kejriwal.\nADVERTISEMENT\n“He was the CM, he can’t be aware of what is happening in every colony. But last year, when one of the residents brought the condition of our colony, which was far worse then, to his notice, he immediately called the MLA and gave him a dressing down. The MLA then rushed to the colony and got the sewage cleared. This time he has even changed the candidate,” Ramesh says.\nIn Bijwasan’s Shahabad-Mohammedpur, Aashu Kumar, 28, who is voting for the AAP because of its schemes, says about the corruption allegations: “Look, every politician makes money. Running a party requires money. But at least this guy is doing something.”\nHis friend Akash adds, “The PM has a massive residence. The President has the Rashtrapati Bhawan. If Kejriwal got a residence made for himself, what is the harm? He was the CM.”\nAt the end of the colony, Jhunnu Devi, hailing from Khagaria in Bihar but now settled in Delhi, and Saroj Devi are discussing confiscation of battery-run rickshaws by the government a few months ago.\nADVERTISEMENT\n“Why take away a poor man’s livelihood? It never happens in Bihar,” Jhunnu Devi says. Interjecting her, Saroj Devi adds: “It happened when Kejriwal was put in jail. Ever since then Delhi has not been functioning properly.”\nIn East Delhi’s Kondli, Munish Kumar, who runs a bakery, has no doubt that the AAP government’s now-scrapped excise policy was a clear case of corruption. But he does not blame Kejriwal for it. “Manish Sisodia made money. There is evidence against him. But what is the evidence against Kejriwal?” he says.\nAmong AAP supporters, there are also those who believe that the AAP government’s failures are due to L-G V K Saxena’s interference in governance.\nMukesh Kumar, who works in the municipality and is waiting for his job to be confirmed, says: “Kejriwal cleared our jobs. Had there been an AAP L-G, it would have been confirmed by now.”\nADVERTISEMENT\nAbout backing the BJP for the Centre and the AAP for Delhi, many AAP voters say that if the MP and MLA are from different parties, there is competition. And that more attention is given to them because of that.\n“I myself voted for the BJP in 2024. But in Delhi, I will vote for the AAP,” says Tarun Kumar, 45, who works in a private firm and lives in Govindpuri, in the Kalkaji constituency.\nIn Sarita Vihar’s H Block market, Chandan Singh, who runs a paan shop, says PM Modi’s popularity is intact in his neighbourhood in the nearby Indira Camp. However, he adds: “He (Modi) is not the CM candidate. The people here vote for Kejriwal for Delhi because he makes policies that benefit us.”\nA Delhi voter, who lives on the premises of a State Bhawan and works as a driver, describes himself as an admirer of the BJP and Modi, as well as the AAP. “I am not a beneficiary of most of the schemes that Kejriwal has brought in – free electricity or water schemes or the free bus ride scheme for women. But he talks about the poor in his speeches. It is good to have a CM who thinks about us. But at the national level, we need a strong PM like Modi,” he says, on condition of anonymity.\nADVERTISEMENT\nAmong middle-class residents in West Delhi’s Dwarka, however, the disillusionment with the AAP is evident. “I voted for the AAP in the past two elections, but Kejriwal has turned out to be like the others. I won’t vote for him this time,” says Y B Singh, a real estate consultant."
    },
    {
        "title": "What are Arvind Kejriwal's 15 guarantees in AAP's manifesto for Delhi?",
        "link": "https://indianexpress.com/article/cities/delhi/delhi-assembly-elections-arvind-kejriwal-guarantees-aap-manifesto-9801613/?ref=hometop_hp",
        "content": "Delhi Elections 2025: With just a week to go before the high-stakes Assembly polls in Delhi, AAP national convenor Arvind Kejriwal unveiled his 15 guarantees on Monday, promising to implement them in the next five years if elected to power.\nAnnouncing his guarantees to the people of Delhi, Kejriwal said, “Today, we are going to release Kejriwal’s guarantee for the upcoming Delhi Assembly polls…Kejriwal’s guarantee means pakki baat. They (BJP) release manifestos and sankalp patras and make promises under many other names…but they don’t fulfil them. Unke liye ye sab chunavi jumle hote hain. The BJP promised to give Rs 15,000. But people never received the money in their accounts. When Amit Shah was asked about this, he said ye sab promises chunavi jumle hain.”\nKejriwal added that if the AAP returned to power in Delhi, it would ensure that no citizen is left without a job. “My first guarantee will be to provide jobs. In the past week, I have visited many areas and met people, who have raised several complaints about unemployment despite having degrees and educational qualifications. We have a team of educated people like Manish Sisodia and Atishi…We are not uneducated like them (BJP). We are making a plan on how to provide employment,” the former chief minister said.\nADVERTISEMENT\nPause\nUnmute\n:\nFullscreen\nThe AAP supremo promised to implement financial assistance of Rs 2,100 under the Mahila Samman Yojana to all women every month as soon as a Government is formed in Delhi.\nSTORIES YOU MAY LIKE\nWhen Rajesh Khanna called son-in-law Akshay Kumar 'hera-pheri wala aadmi', advised Twinkle to keep his leash tight\nDoctor kidnapped in Karnataka for Rs 6-crore ransom, let off with Rs 300 to return home\nAsha Bhosle's granddaughter Zanai, cricketer Mohammed Siraj address dating rumours\nOther guarantees from AAP include the Sanjeevani Yojana—free healthcare for senior citizens above 60 years, waiving of inflated water bills, Ambedkar scholarship for Dalit students pursuing higher education and free bus travel for all students, along with a 50 per cent concession on metro fares.\nKejriwal also apologised for not fulfilling his promises regarding the cleaning of the Yamuna and the repair of roads as per European standards, which he made during the 2020 polls.\n“Yamuna cleaning, European roads…Today, I am accepting in front of everyone that we could not fulfil this promise. But I have my reasons—In the first two years, there was Covid. After that, they framed us in the wrong cases and put us in jail. Ministers like Satyender Jain, Manish Sisodia, Sanjay and I were also arrested… Due to this, our entire team was shattered and we could not implement this work on the ground. But I promise to fulfil this in the next term. We have funds as well as plans to implement these schemes,” he said.\nKejriwal also took a pledge and signed the guarantees.\nADVERTISEMENT\nKejriwal said the ongoing six “revdis”—free electricity up to 200 units, water, education and others—will continue.\nTaking a dig at the BJP, Kejriwal warned the public that all these schemes—free education, free electricity, water, mohalla clinics and free bus travel—will cease as soon as they press the lotus button on the electronic voting machine.\n“You are saving Rs 25,000 every month due to the AAP’s schemes. Rs 25,000 per month is a huge amount for a poor person and even for the middle class, who earn Rs 75,000 to Rs 80,000 per month. So, I appeal to you all to press the button. Hum sab log jhaadu ko ghar ki laxmi maante hain. Jhadu ka button dabaiye. Delhi will grow, you will get relief and live a happy life,” he said.\nThe three-cornered fight between the AAP, BJP, and Congress will take place on February 5, with results to be declared on February 8.\nKejriwal’s guarantees:\n1. Unemployment to be solved\n2. Mahila Samman Yojana (monthly Rs 2,100 to every woman)\nADVERTISEMENT\n3. Sanjeevani Yojana (free medical services to all above 60 years at all hospitals)\n4. Inflated water bills to be waived\n5. 24×7 clean drinking water in all households in Delhi\n6. The Yamuna to be cleaned\n7. Roads to be made and maintained as per European standards\n8. Dr Ambedkar Scholarship Yojana (Government to fund foreign education for Dalit students)\n9. Free bus travel for all students; 50% concession on metro fares\n10. Rs 18,000 per month for all pujaris and granthis\n11. Free electricity and water\n12. All blocked and old sewage lines to be replaced\n13. A window to issue new ration cards\nADVERTISEMENT\n14. Rs 10 lakh life insurance and Rs 5 lakh accident insurance for all autorickshaw drivers and e-rickshaw pullers. Wedding aid of Rs 1 lakh for their daughters and free coaching for their children.\n15.Funds for RWAs to appoint and maintain independent security guards"
    },
    {
        "title": "Jasprit Bumrah wins ICC men's Test Cricketer of the Year award",
        "link": "https://indianexpress.com/article/sports/cricket/jasprit-bumrah-wins-icc-mens-test-cricketer-of-the-year-award-9801958/?ref=hometop_hp",
        "content": "Jasprit Bumrah on Monday has been named as ICC men’s Test Cricketer of the Year. The Indian spearhead has an excellent 2024 in both home and away conditions. He picked up 71 wickets in 13 matches.\nJasprit Bumrah pipped England batters Joe Root and Harry Brook, and Sri Lanka’s middle-order batter Kamindu Mendis for the award.\nJasprit Bumrah has been the spearhead of Indian cricket for the longest time, but this year proved to be at the top of his game.\nADVERTISEMENT\nPause\nUnmute\n:\nFullscreen\nJasprit Bumrah called out a post on X that claimed he was advised bed rest for his back injury. (BCCI)\n“I am deeply honored to receive the ICC Men’s Test Cricketer of the Year award. Test cricket has always been a format I hold close to my heart, and to be recognized on this platform is truly special,” Bumrah said.\nSTORIES YOU MAY LIKE\nIn Our Opinion: 5 things to watch out for in the Budget\nWhen Rajesh Khanna called son-in-law Akshay Kumar 'hera-pheri wala aadmi', advised Twinkle to keep his leash tight\nAsha Bhosle's granddaughter Zanai, cricketer Mohammed Siraj address dating rumours\n“This award is not just a reflection of my individual efforts but also of the unwavering support of my teammates, coaches, and fans who continue to believe and inspire me every day. Representing India is a privilege I deeply cherish, and knowing my efforts bring smiles to people around the world makes this journey even more special.”\nJasprit Bumrah in action. (FILE)\nBumrah was impressive in all conditions, but his best performance so far has been in the Border-Gavaskar Trophy, as he has picked up 30 wickets with a match to go. The series also witnessed him reach the 200 Test wickets milestone, becoming the fastest Indian to reach this feat.\nWith India’s captain Rohit Sharma not available for the first Test of the Border Gavaskar Trophy in Perth, Bumrah took up the reins to lead the team to a 295-run victory. After being all-out for just 150 in the first innings, Bumrah shifted the control of the game to their side with a five wicket haul, and eventually bagged the three wickets in the second innings that closed the door on Australia who were chasing 534.\nADVERTISEMENT\nBumrah’s performances saw him climb back to the top of the ICC Test bowlers rankings, and eventually won the ICC Men’s Test Cricketer of the Year award."
    },
    {
        "title": "When a tiger killed Shanti: What makes women vulnerable to tiger attacks in Corbett",
        "link": "https://indianexpress.com/article/long-reads/tiger-attack-corbett-shanti-killed-women-9801183/?ref=hometop_hp",
        "content": "On January 7, Shanti Devi was attacked by a tiger, metres away from her home at Okhaldhunga in the Ramnagar forest division near Corbett Tiger Reserve in Uttarakhand. Villagers say the 47-year-old was on a tree, cutting leaves for her horse, and was climbing down when the tiger caught her by the foot. Around 5.30 pm, her husband found her decapitated body and her sandals in the shrubs.\n“Tigers have never attacked us before… They prey on goats and dogs; not humans. In fact, children from our village have to walk five km to reach the inter-college (for Classes 11 and 12). We often hear the tigers roar and it shakes the floor, but we never feared for our lives until now,” says Shanti’s mother-in-law Anuli Devi, 70.\nYou’re just one step away from accessing this premium story.\nSubscribe Now\nAlready a subscriber? Sign in"
    },
    {
        "title": "Forget smart TVs, this Rs 3,999 projector is a game changer for movie nights",
        "link": "https://indianexpress.com/article/technology/tech-reviews/tecsox-luma-led-projector-review-9798700/",
        "content": "Cinephile or casual moviegoer, there has always been this one moment where you longed for a personal theater experience. Something like a projector, exclusively for yourself. For a movie fanatic like me, the idea of projectors has been elusive, mainly because of the hefty price tag attached to them. But what if you get a projector that is compact, offers stunning visuals, and doesn’t burn a hole in your wallet?\nPerhaps this was the idea that thrilled me when I was offered the opportunity to review the all-new Android Smart Portable projector by TecSox. I have always been asked about affordable projectors that were handy and easy to use, but seldom was I able to pinpoint one particular device. I have been using the TecSox projector for some time. I feel the time has come for portable projectors to foray into homes that have been dominated by smart TVs for long. \nAlso Read | Formovie’s Xming Page One can project any TV out of the room and still cost less\nA top view of the TecSox LUMA LED Projector. (Photo: Bijin Jose/The Indian Express)\nIt was in December last year that TecSox introduced Luma Led, bringing the concept of portable projectors back to the mainstream from relative obscurity. During my use, I found the device to be designed to redefine home entertainment and professional presentations. At Rs 3,999, the LUMA LED projector is groundbreaking and signals a significant leap in making advanced technology accessible to the masses. \nADVERTISEMENT\nPause\nUnmute\n:\nFullscreen\nWhat is so special about the LUMA LED Projector?\nFirstly, the device packs some impressive capabilities in its tiny frame, and that, to me, is distinctive. It supports both 4K and 1080P resolutions. It needs to be noted that the native resolution is 1280×720 pixels with support for higher resolutions through scaling. To try this I connected the LUMA LED to my home WiFi and played 4K and other upscaled videos. I was surprised by the vivid images it showed on the plain wall in my bedroom. The mini projector delivers exceptional image clarity, something that I was not expecting. \nSTORIES YOU MAY LIKE\nDoctor kidnapped in Karnataka for Rs 6-crore ransom, let off with Rs 300 to return home\nWhen Rajesh Khanna called son-in-law Akshay Kumar 'hera-pheri wala aadmi', advised Twinkle to keep his leash tight\nShilpa Shetty’s ‘Monday Motivation’ is all about her ‘firsts’ on family vacation to Maldives\nThe wall in my room transformed into a theatre after I switched on the LUMA LED projector. The 4K visuals came to life when the lights were switched off. (Photo: Bijin Jose/The Indian Express)\nThe LUMA LED comes with an in-built Android system, which virtually eliminates the need for you to connect any external device to it. You could download your favourite streamer and play, all in the convenience of your home. The moment I saw the visual spectacle in front of my eyes, the first thing that came to my mind was this could be a great way to bring friends to my bachelor pad to enjoy cricket, football, or movie nights. \nThe LUMA LED Projector is ideal for watching movies, cricket, and high-resolution videos. (Photo: Bijin Jose/The Indian Express)\nFor any device, connectivity is key today. Thankfully, the LUMA LED comes with WiFi 6 technology that ensures the device is streaming seamlessly without any latency. Another addition is the Bluetooth compatibility, which allows you to connect external speakers and devices to enjoy an immersive audio-visual experience. \nThe TecSox LUMA LED projector is portable and lightweight. (Photo: Bijin Jose/The Indian Express)\nThe first thing that you are likely to notice is the design and portability of the LUMA, which is quite different from conventional projectors. It can be rotated 180 degrees, and the auto vertical correction allows flexible projection on all surfaces. This makes it an ideal choice for outdoor movie nights or cricket matches. It is also dynamic and can double up as a flexible option for business presentations. The LUMA’s compact and lightweight build makes it easy to carry, and you can set it up almost anywhere. \nADVERTISEMENT\nIs it for you?\nThe LUMA comes with a host of advantages; however, users may vary about its long-term durability and comprehensive performance in different environments. I found it to be working effortlessly when placed closer to the wall; at longer distances, the auto vertical correction stumbled a bit. The remote control to the projector was unwieldy at times; however, this could have been isolated to my device. The company offers a six month warranty, which will soon be extended to one year and is claimable via customer support. Besides, the company claims that it replaces products after verifying issues via video calls.\nAlso Read | OnePlus 13R Review: A well-rounded, affordable flagship that’s high on performance\nRegardless, the combination of advanced features, smart functionality, and the affordability factor makes the TecSox LUMA LED projector a compelling buy, especially for those looking for high-quality visuals without much of an investment. \nPros Cons\nAffordable pricing Long-term durability uncertain\n4K and 1080P support May lack some high-end projector features\nBuilt-in Android system Android 11.o\nWiFi 6 connectivity\nBluetooth compatibility\n180° rotatable design\nAuto vertical correction\nLightweight and portable\nThe LUMA LED works best for budget-conscious consumers, travellers, cinephiles, and professionals looking for portable presentation solutions. The projector’s ability to offer 4K and 1080P resolution, an integrated Android system, robust connectivity, and flexible projection capabilities makes it a standout product in the consumer electronics market.\n "
    },
    {
        "title": "Out for walk on beach, Goa businessman killed after ‘altercation with shack worker’",
        "link": "https://indianexpress.com/article/india/goa-businessman-killed-fist-fight-beach-shack-worker-9801630/",
        "content": "A 38-year-old businessman from Goa was killed allegedly after an altercation with a beach shack worker over the placement of benches at North Goa’s Arambol beach on Sunday evening, said police. One accused has been arrested.\nPolice identified the deceased as Amar Bandekar, a businessman from Arambol. According to the police, the victim had gone for an evening walk on the beach on Sunday. Police said he allegedly told the staff at the beach shack to remove a bench that was purportedly blocking his path, and this led to an argument with a worker at the shack.\nNorth Goa SP Akshat Kaushal said, “We have arrested one person. As per preliminary probe, an argument took place which escalated into a fist fight. One person has succumbed to injuries. The circumstances leading to the incident are being probed. So far, we have found involvement of one person in the case. If the probe suggests involvement of more people, we shall take action accordingly.”\nADVERTISEMENT\nPause\nUnmute\n:\nFullscreen\nThe victim was rushed to a primary health centre in Tuem, where he was declared brought dead. On Sunday night, locals from the area gathered outside Mandrem police station, demanding action against the beach shack operators and justice for the victim’s family.\nSTORIES YOU MAY LIKE\nDoctor kidnapped in Karnataka for Rs 6-crore ransom, let off with Rs 300 to return home\nWhen Rajesh Khanna called son-in-law Akshay Kumar 'hera-pheri wala aadmi', advised Twinkle to keep his leash tight\nNamita Thapar slams Anupam Mittal for ‘exploiting’ pitcher on Shark Tank India 4, he claps back: ‘Exploitation occurs when…’\nDevendra Prabhudesai, a local resident, told the media, “He [Bandekar] used to regularly go for walks on the beach. In the evening, when he saw some benches blocking the way, he removed one and the repercussion was his death. Who is responsible for this death? Law and order has just collapsed and the government does not seem to be bothered about it. We have met the police inspector and he has assured us that a thorough investigation will be done and no one will be let off.”\n“Why is no patrolling being conducted on the beach? The beach is totally occupied by the shacks. How are the people going to walk?” he asked.\nEarlier this month, a 28-year-old tourist from Andhra Pradesh was killed after an altercation with a beach shack owner and shack workers over placing a food order in Calangute."
    },
    {
        "title": "Maha Kumbh Mela, from space: NASA astronaut shares photos of an illuminated Prayagraj from ISS",
        "link": "https://indianexpress.com/article/india/maha-kumbh-mela-prayagraj-nasa-iss-9801921/",
        "content": "NASA astronaut Don Pettit, aboard the International Space Station (ISS), shared photographs of the Maha Kumbh Mela from space, capturing the grandeur of the illuminated city of Prayagraj from an unparalleled perspective.\nPettit, renowned for his astrophotography, posted the images on X, writing, “2025 Maha Kumbh Mela Ganges River pilgrimage from the ISS at night. The largest human gathering in the world is well lit.”\nThe images show the dazzling confluence of the Ganga, Yamuna, and the mythical Saraswati rivers.\n2025 Maha Kumbh Mela Ganges River pilgrimage from the ISS at night. The largest human gathering in the world is well lit. pic.twitter.com/l9YD6o0Llo\n— Don Pettit (@astro_Pettit) January 26, 2025\nThe Maha Kumbh Mela, which occurs once every 144 years, started on January 13 and will go on for 45 days, drawing millions of devotees, saints, and tourists. The Uttar Pradesh government has allocated a staggering Rs 400 crore to ensure uninterrupted electricity and advanced infrastructure to manage the massive influx of visitors.\nADVERTISEMENT\nPause\nUnmute\n:\nFullscreen\nUP government’s measures for Maha Kumbh Mela\n85 sub-stations have been installed to illuminate the Maha Kumbh area spread over more than 4,000 hectares. The electricity consumption during the 45-day event is estimated to cost Rs 30 crore. Nearly 2 lakh units of electricity will be consumed daily, officials have said.\nSTORIES YOU MAY LIKE\nMamta Kulkarni says she ‘can’t imagine doing films again’ after taking sanyas at Maha Kumbh\nDoctor kidnapped in Karnataka for Rs 6-crore ransom, let off with Rs 300 to return home\nAsha Bhosle's granddaughter Zanai, cricketer Mohammed Siraj address dating rumours\nAs many as 52,000 electric poles, 70,000 LED lights and 2,016 solar hybrid lights have been installed in the area. The solar hybrid lights, placed along the main roads, are programmed to automatically turn on in the evening and off in morning.\nAround 1.6 lakh tents and 50,000 shops will come up for the event, said an official.\nHigh-powered cameras of the ISIS captured the Maha Kumbh Mela from space. Pettit is currently joined on the ISS by fellow astronauts Sunita Williams and Barry Willmore, among others.\nADVERTISEMENT\nThe Indian Space Research Organisation (ISRO) had last week released satellite images of the Maha Kumbh Mela."
    },
    {
        "title": "Fatima Sana Shaikh recalls casting couch experience in South Indian film: ‘You will do everything, right?’",
        "link": "https://indianexpress.com/article/entertainment/bollywood/fatima-sana-shaikh-recalls-casting-couch-experience-in-south-indian-film-you-will-do-everything-right-9802000/",
        "content": "Fatima Sana Shaikh rose to fame with her standout performance in Aamir Khan’s Dangal, but the journey leading up to the film wasn’t without its challenges. In a recent interaction, Fatima opened up about her early experiences in the industry, revealing how she faced the reality of the casting couch during the initial years of her career. She shared how unscrupulous casting directors took advantage of aspiring actors in Mumbai, often demanding a cut from their earnings.\nDuring a conversation on Bollywood Bubble, Fatima explained how every studio had its own auditions, which were often discovered through word-of-mouth among struggling actors. However, the casting director, who would be present at these studios, would ask actors to list their references on the audition forms. Later, when actors received payment for commercials or advertisements, they would find that a portion of their earnings had been taken by the same casting director. She recalled, “Even if we were at the audition through word-of-mouth, the casting director would ask us to write down our reference. That means you have to give 15 percent of your payment to them, despite not knowing them at all.”\nFatima clarified that reputable casting directors don’t engage in such practices. She added, “Known casting directors won’t do that; only fraud people would. Of course Mukesh Chhabra and Anmol Ahuja don’t do that. But there are shady individuals who take advantage of young, struggling actors who are new to the city and don’t know much.”\nADVERTISEMENT\nPause\nUnmute\n:\nFullscreen\nAlso read | Chhaava director Laxman Utekar deletes dance scenes from Vicky Kaushal-starrer amid controversy: ‘Raj Thackeray gave guidance’\nFatima also recalled a casting couch experience, particularly a call she received about being cast in a South Indian film. The casting agent made her feel uncomfortable. She said, “He asked me, ‘You will be ready to do everything, right?’ I told him that I will be working hard and will do what is required for the role, but he kept saying that and I played dumb because I wanted to see how low can he get.”\nSTORIES YOU MAY LIKE\nWhen Rajesh Khanna called son-in-law Akshay Kumar 'hera-pheri wala aadmi', advised Twinkle to keep his leash tight\nIn Our Opinion: 5 things to watch out for in the Budget\nNamita Thapar slams Anupam Mittal for ‘exploiting’ pitcher on Shark Tank India 4, he claps back: ‘Exploitation occurs when…’\nShe also shared another unsettling experience when she was in Hyderabad, hopeful about securing a South film role that could serve as a stepping stone to Bollywood. However, she recalled how some “small producers” openly discussed the casting couch, though not directly. “We were in a room, and the producers would talk about it very openly, giving indications that you have to meet people. They wouldn’t say it outright, but it was clear what they meant. However, not everyone is like that,” she said.\nClick here to follow Screen Digital on YouTube and stay updated with the latest from the world of cinema."
    },
    {
        "title": "Ram Kapoor followed this eating pattern to lose 55 kg; expert shares the diet's effectiveness",
        "link": "https://indianexpress.com/article/lifestyle/food-wine/ram-kapoor-eating-pattern-massive-weight-loss-expert-effectiveness-9780153/",
        "content": "Ram Kapoor has been in the news for a while, following his impressive weight loss transformation. Speaking about his diet, the actor who lost 55 kilos said, “I now eat twice a day. My first meal is at about 10.30-11 am. And my second meal is at 6.30 pm. No snacking. 45 minutes of cardio, 45 minutes of weight training.” Kapoor further told Devna Gandhi on her podcast that he consumes a natural diet and is working on his lifestyle, including sleep.\nTaking a cue, let’s understand whether eating only twice daily is sustainable.\nJinal Patel, dietician, Zynova Shalby Hospital Mumbai, said eating twice a day can be a sustainable approach to lose weight for some individuals. “But people need to understand that for weight loss results to show, one needs to make continuous efforts. Healthy weight loss can be achieved with the help of a nourishing diet, but it also depends on factors like the quality of your meals, portion sizes, and personal lifestyle,” said Patel.\nADVERTISEMENT\nPause\nUnmute\n:\nFullscreen\nShe added that the eating twice approach to weight loss is quite similar to intermittent fasting. “In intermittent fasting, one eats only during the eating window and not otherwise,” said Patel.\nSTORIES YOU MAY LIKE\nMamta Kulkarni says she ‘can’t imagine doing films again’ after taking sanyas at Maha Kumbh\nAsha Bhosle's granddaughter Zanai, cricketer Mohammed Siraj address dating rumours\nDoctor kidnapped in Karnataka for Rs 6-crore ransom, let off with Rs 300 to return home\nHowever, it may not work for everyone. “Instead of weight loss, you may start to gain weight as fasting can significantly slow down your metabolism, making it challenging to lose weight. Due to eating restrictions, some people tend to overeat during the eating window, leading to weight gain,” contested Patel.\nIt’s essential to eat healthy (Source: Getty Images/Thinkstock)\nFor healthy weight loss, one should never skip their meals.\nAlso Read | Can you lose weight with only one type of diet?\n“The key is maintaining a healthy balance, avoiding unhealthy foods, and checking the portion size. Eat foods enriched with goodness or essential nutrients like vitamins, healthy fats, fibre, omega-3 fatty acids, and protein can help with better results,” said Patel.\nThis can help you stay full and energised throughout the day. “Strictly avoid foods that are packed, processed, or contain preservations. Choose healthy food alternatives over unhealthy options,” said Patel.\nADVERTISEMENT\nDISCLAIMER: This article is based on information from the public domain and/or the experts we spoke to. Always consult your health practitioner before starting any routine.\n📣 For more lifestyle news, click here to join our WhatsApp Channel and also follow us on Instagram"
    },
    {
        "title": "Asha Bhosle's granddaughter Zanai, cricketer Mohammed Siraj address dating rumours",
        "link": "https://indianexpress.com/article/entertainment/music/asha-bhosles-granddaughter-zanai-bhosle-cricketer-mohammed-siraj-address-dating-rumours-9801340/",
        "content": "Last week a picture of Asha Bhosle‘s granddaughter Zanai Bhosle chilling with cricketer Mohammed Siraj went viral on social media. This picture was from Zanai’s 23rd birthday party; both Zanai and Siraj were seen laughing over something in the photo. The said picture sparked dating rumors between Zanai and Siraj. Now, clearing the air, both Zanai and Mohammed Siraj took to their social media accounts clarifying that they are not in a relationship.\nBoth Zanai and Mohammed Siraj reshared their pictures on their respective Instagram stories calling each other ‘bhai-behen.’ Zanai wrote, “Mere Pyaare Bhai (My sweet brother).” Siraj also took to Instagram and wrote, “Meri behen ke jaisi koi behna nahin. Bina iske kahin bhi mujhe rehna nahin. Jaise hai chaand sitaaron mein, meri behna hai ek hazaaro mein,” (No is like my sister, I don’t want to live without her. Just like the moon and stars, my sister is one of a kind).\nZanai Bhosle on dating rumors with cricketer Mohammed Siraj (Photo: Zanai Bhosle / Instagram Stories)\nAlso Read: There is sense of pressure, says Asha Bhosle’s granddaughter Zanai Bhosle\nCricketer Mohammed Siraj clarfies relationship rumours with singer Zanai Bhosle (Photo: Mohammed Siraj / Instagram)\nRumors about the singer and cricketer seeing each other started after Zanai shared some pictures from her birthday party that was held at a restaurant in Mumbai last week. Many other celebrities and cricketers were also a part of the evening. However, it was her picture with Siraj that caught the internet’s attention. Reacting to it, one fan wrote, “Are you going to marry Siraj bhaijaan Zanai Bhosle?” another user commented, “Yahi hai kya bhabhi ji?” Others also dropped heart-eye emojis on the pictures.\nOther than Siraj, Zanai also shared pictures with her grandmother Asha Bhosle, Jackie Shroff, actor Abhay Verma, Ayesha Khan, Shreyas Iyer, and others. Professionally, Zanai is a singer like her grandmother, she is usually seen singing for various music videos. Her latest song is called Kehndi Hai.\nClick here to follow Screen Digital on YouTube and stay updated with the latest from the world of cinema."
    },
    {
        "title": "Bigg Boss 18 winner Karanveer Mehra’s ex-wife Nidhi Seth gets married. See pics",
        "link": "https://indianexpress.com/article/entertainment/television/bigg-boss-18-winner-karanveer-mehras-ex-wife-nidhi-seth-gets-married-see-pics-9801830/",
        "content": "Bigg Boss 18 winner Karanveer Mehra‘s ex-wife Nidhi Seth recently tied the knot with Sandiip Kumar. The actress took to social media to share pictures from her wedding in Bangalore.\nNidhi Seth shared photos from her wedding with Sandiip Kumar and wrote, “You have shown me that love is not a struggle but a beautifully shared journey. In our marriage, it’s always ‘we’ over ‘me’. Your unwavering loyalty and care make me feel cherished and free, and I trust that our bond grows stronger each day. Over the past two years, you’ve transformed memories into treasures and stood by me through every joy and challenge. I’m grateful for your support, kindness, and the beautiful relationship we share. Thank you for being my rock, for saying “YES” to me, and for filling my life with love. I love you SK.”\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in\nClick here to follow Screen Digital on YouTube and stay updated with the latest from the world of cinema."
    },
    {
        "title": "Doctor kidnapped in Karnataka for Rs 6-crore ransom, let off with Rs 300 to return home",
        "link": "https://indianexpress.com/article/cities/bangalore/doctor-kidnapped-karnataka-ransom-return-home-9800921/",
        "content": "A paediatrician working in the Ballari district hospital in Karnataka was on Saturday kidnapped and a ransom of Rs 6 crore was demanded of his brother, police said, adding that the kidnappers released the doctor hours later, giving him Rs 300 to return home.\nDr Sunil, 45, was on a morning walk near the Shaneshwara temple in Suryanarayanapet around 6 am when a gang arrived in a Tata Indigo car, forcefully got him into the vehicle and sped away, a police officer said. The entire act was caught on CCTV cameras, according to the police.\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in"
    },
    {
        "title": "Mamta Kulkarni says she ‘can’t imagine doing films again’ after taking sanyas at Maha Kumbh",
        "link": "https://indianexpress.com/article/entertainment/bollywood/mamta-kulkarni-says-she-cant-imagine-doing-films-again-after-taking-sanyas-at-maha-kumbh-9801430/",
        "content": "Former actress Mamta Kulkarni, known for her roles in 90s Bollywood films, recently renounced worldly life as she took sanyas during the Maha Kumbh Mela 2025, joining the Kinnar Akhara. She assumed the title of “Mahamandleshwar” and was given the name Shri Yamai Mamta Nandgiri. After embracing the spiritual path as a Sadhvi, the Baazi actor expressed that returning to the film industry is unimaginable for her at this stage of her life.\nIn a conversation with India Today, Mamta shared, “I can’t even imagine doing films again. It is absolutely impossible for me now.” Reflecting on her journey in the entertainment industry, she added, “You need everything in life, including entertainment. You should acknowledge your needs. But, spirituality is something that you can only achieve through luck. Siddhartha (Prince Siddhārtha Gautama who became Lord Buddha) saw everything in his life and then decided to change.”\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in\nClick here to follow Screen Digital on YouTube and stay updated with the latest from the world of cinema."
    },
    {
        "title": "Why ajwain is the nutrition powerhouse you need for weight loss",
        "link": "https://indianexpress.com/article/health-wellness/ajwain-nutrition-powerhouse-weight-loss-respiratory-health-oral-hygiene-9801211/",
        "content": "Written by Dr Ridhima Khamsera\nWhen it comes to kitchen staples with extraordinary health benefits, ajwain — also known as carom seed —is often associated with its digestive superpowers. Its active compound, thymol, stimulates gastric juices, helping to break down food more efficiently. But did you know that ajwain can also  be an effective ally for weight loss?\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in"
    },
    {
        "title": "Twinkle Khanna 'blamed' for political differences with Akshay Kumar",
        "link": "https://indianexpress.com/article/entertainment/bollywood/twinkle-khanna-says-she-blamed-for-political-differences-with-akshay-kumar-as-if-he-isnt-my-husband-but-a-toddler-9801280/",
        "content": "Despite being one of Bollywood’s most beloved power couples, Akshay Kumar and Twinkle Khanna have openly acknowledged that they have more differences than similarities. Akshay once joked that apart from their shared habits of sleeping early, waking up early and enjoying games like Rummy and Ludo, they have little in common. “She thinks left, I think right,” he remarked in an interview last year. Recently, Twinkle revealed that she is frequently questioned about — and often blamed for — their differing political views. She pointed out that those who raise such concerns, however, never stop for a moment to think and understand that they are both independent individuals, capable of having their own ideologies.\nIn her recent column for The Times of India, Twinkle, also known by her pen name “Mrs Funnybones”, took a sharp jab at such people by questioning whether people believe Akshay is a child who would follow her instructions if she told him, “Beta ji, please walk on the left side of the road, and I will give you a Frooti.”\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in\nClick here to follow Screen Digital on YouTube and stay updated with the latest from the world of cinema."
    },
    {
        "title": "Man murders cousin, sets body on fire before dumping it in Delhi’s Ghazipur; arrested",
        "link": "https://indianexpress.com/article/cities/delhi/delhi-ghazipur-murder-case-cousin-killed-body-set-on-fire-9801666/",
        "content": "The Delhi Police said Monday they arrested a man who allegedly killed his cousin, stuffed her body in a suitcase, and set it on fire with the help of his friend in the Capital’s Ghazipur area.\nAccording to the police, they received a PCR call at around 4.10 am Sunday about a partially burnt suitcase containing a person’s body. When a police team arrived at the spot, they found the burnt remains of a person estimated to be between 20 to 35 years of age. The suitcase had burnt away, save for the steel handle and the lower portion, exposing the body. The police said the body had been burnt beyond recognition leaving no markings or evidence to identify it. The only evidence that could point to the person’s gender was the long hair which was intact.\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in"
    },
    {
        "title": "Pakistan captain Shan Masood slams journalist for ‘disrespectful’ question: ‘No one will tolerate…’",
        "link": "https://indianexpress.com/article/sports/cricket/pakistan-captain-shan-masood-loses-cool-disrespect-journalist-9802044/",
        "content": "Pakistan Test skipper Shan Masood slammed a journalist and asked the media to stop disrespecting the players after the hosts lost to West Indies by 120 runs in the 2nd Test.\nThe incident occurred in the post-match press conference when a journalist asked Masood if he will step down as leader of the pack on his own or the PCB will have to remove him.\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in"
    },
    {
        "title": "Border 2 producer Nidhi Dutta calls taking JP Dutta’s franchise forward a ‘responsibility’: ‘It is going to be so much like Border because…’",
        "link": "https://indianexpress.com/article/entertainment/bollywood/border-2-producer-nidhi-dutta-calls-taking-jp-duttas-franchise-forward-a-responsibility-9800013/?ref=latestnews_hp",
        "content": "Border 2 is one of the most highly anticipated films, scheduled to hit theatres next year. JP Dutta’s daughter Nidhi Dutta is all set to take the franchise forward with a dynamic cast. In an exclusive interview with SCREEN, Nidhi, the co-producer and writer of Border 2, opened up about the legacy of Border and working on the upcoming film with Sunny Deol, Diljit Dosanjh, Varun Dhawan and Ahan Shetty.\nTalking about expectations that the audience might have from Border 2, considering the huge success of Border, Nidhi says, “I wouldn’t use the word pressure, I would call it a responsibility. I think it’s a very big responsibility and a blessing to be able to do this. I am glad that I have the opportunity to tell more stories from the 1971 war and take the franchise forward. I am blessed to be his (JP Dutta) daughter, because of which I have the background and knowledge to be able to write a story like this and do this.”\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in\nClick here to follow Screen Digital on YouTube and stay updated with the latest from the world of cinema."
    },
    {
        "title": "India vs England T20I | ‘Harry Brook, you keep in your mind…’: R Ashwin takes a dig at ENG batter",
        "link": "https://indianexpress.com/article/sports/cricket/r-ashwin-harry-brook-comment-india-vs-england-t20is-9802235/?ref=latestnews_hp",
        "content": "With England batsman Harry Brook blaming smog during batting in the first T20I against India in Kolkata followed by his cheap dismissal in the second T20I at Chennai, former Indian off-spinner Ravichandran Ashwin has taken a dig at England’s batting technique. Brook had hoped that conditions would be easier in Chennai prior to the second match but got dismissed against Indian spinner Varun Chakravarthy once again in the series failing to read a googly.\n“One thing which I noticed when the England batsman handled Varun Chakravarthy, there was no smog in Chennai. Harry Brook got bowled at Eden Gardens and had said that there was a lot of smog in Eden Gardens and lighting was tough. I want to tell one thing to Harry Brook. Harry Brook, you keep in your mind that Varun Chakravarthy’s leg spin does not spin that much. It’s his googly,” said Ashwin on his Youtube channel Ash ki Baat.\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in"
    },
    {
        "title": "Income Tax slabs recast: Rs 80,000 a year and up: Banking on increase in take-home to spur spends",
        "link": "https://indianexpress.com/article/business/budget/income-tax-slabs-recast-rs-80000-a-year-and-up-banking-on-increase-in-take-home-to-spur-spends-9812770/?ref=hometop_hp",
        "content": "THE INCOME Tax bonanza, including increase in exemption slab from Rs 7 lakh to Rs 12 lakh (annual income) and tweaks in rates and slabs, will benefit taxpayers across income brackets.\nWith the increase in exemption slab to Rs 12 lakh, those who earn up to Rs 1 lakh per month will not have to pay any Income Tax. According to the government, nearly 1 crore taxpayers who fall in this income bracket are expected to benefit from this move.\nAnother 75 lakh taxpayers, with taxable income of above Rs 12 lakh, are expected to benefit on account of tweaks in the tax slabs and rates as per the proposed changes to the new tax regime (NTR), with savings of up to Rs 1.1 lakh, according to sources.\nSTORY CONTINUES BELOW THIS AD\nAlso Read | Budget in a nutshell: Five major takeaways from Finance Minister’s speech\nThe new tax slabs under the NTR are: no tax on annual income of up to Rs 4 lakh; 5 per cent on Rs 4 lakh-8 lakh; 10 per cent on Rs 8 lakh-12 lakh; 15 per cent on Rs 12 lakh-16 lakh; 20 per cent on Rs 16 lakh-20 lakh; 25 per cent on Rs 20 lakh-24 lakh; and 30 per cent on annual income above Rs 24 lakh.\nSTORIES YOU MAY LIKE\nWhat does the Rs 12 lakh I-T rebate mean?\nIND vs ENG 5th T20I Predicted Playing 11: Harshit Rana, Mohammed Shami in India Playing XI\nArmed with a foreign degree, engineer ran PhD admissions racket; arrested\nThe tweak is significant as the income level for the highest tax slab has been raised from the existing Rs 15 lakh to Rs 24 lakh.\nUnder the NTR, annual taxable income is calculated by deducting Rs 75,000 (standard deduction) from the salary, and this benefit is available to all taxpayers under the regime. So effectively, those with an annual salary of Rs 12.75 lakh will have no tax liability as per the Budget proposal.\nUnder the current NTR, an individual with an annual income of Rs 12 lakh has a tax liability of Rs 80,000.\nSTORY CONTINUES BELOW THIS AD\nHowever, while the tax exemption slab has been increased from Rs 7 lakh to Rs 12 lakh (annual income), it does not mean that those earning over Rs 12 lakh will have to pay tax only on the extra amount.\nIf taxable income is even Rs 12.1 lakh, the tax levied will be as per the slab rates under the NTR. So, on a taxable income of Rs 12.1 lakh, the Income Tax liability would be Rs 61,500 — sum of 5 per cent tax on income of Rs 4 lakh-8 lakh, 10 per cent on Rs 8 lakh-12 lakh, and 15 per cent on Rs 12 lakh-16 lakh. Similarly, an individual earning Rs 15 lakh will end up paying a tax of Rs 1,05,000.\nAlso Read | The Budget and its politics: Middle class, Bihar, farmers\nThe latest rate rationalisation and rebate have further sweetened the simplified NTR, and could prove to be the final nail in the coffin for the old tax regime (OTR), which has been left untouched in the Budget. Over the past few years, the government has been trying to make the simple and exemption-free NTR the preferred tax regime for salaried taxpayers.\nA rough calculation shows that while an individual with a gross salary of Rs 15.75 lakh (pre-standard deduction) would have to pay a tax of Rs 1.27 lakh under the old tax regime even after he claims deductions of up to Rs 4.75 lakh (including investments under 80C, home loan interest outgo, health insurance for self and parents, and investment of Rs 50,000 under NPS), the tax outgo will be significantly lower at Rs 1.05 lakh under the proposed new tax regime.\nSTORY CONTINUES BELOW THIS AD\nRead | With zero tax upto Rs 12 lakh, you will take home the same as someone with income of Rs 12.71 lakh. Here’s why\nBarring a few exceptions where individuals also claim HRA benefits of over Rs 5 lakh, the proposed NTR will be beneficial for most taxpayers.\nA senior finance ministry official said that while about 75 per cent of taxpayers have already moved to the NTR, the latest move is likely to ensure that the remaining too opt for it.\nSukalp Sharma\nFollow\nSukalp Sharma is a Senior Assistant Editor with The Indian Express and writes on a host of subjects and sectors, notably energy and aviation. He has over 13 years of experience in journalism with a body of work spanning areas like politics, development, equity markets, corporates, trade, and economic policy. He considers himself an above-average photographer, which goes well with his love for travel.\n... Read More"
    },
    {
        "title": "Why Makhana Board for Bihar is a decisive move in Assembly election year",
        "link": "https://indianexpress.com/article/political-pulse/why-makhana-board-bihar-decisive-move-assembly-election-year-9812318/?ref=hometop_hp",
        "content": "The announcement of a food processing institute and a Makhana Board for Bihar in the Union Budget is not merely an economic impetus to the state ahead of the Assembly elections later this year but also carries a political message. It is likely to please the Mallah community (fisherfolk and boatmen) that does not have fixed loyalties in the state’s political landscape.\nBihar is the largest producer of makhana (fox nuts) in the country, accounting for an estimated 90% of production. The farming and harvesting of makhana is almost entirely done by Mallahs who are also among the most impoverished communities.\nMuch of Makhana farming is done in the riverine belts of North Bihar spanning from Sitamarhi-Madhubani to the Supaul-Kishenganj belts. Mallahs, who account for about 2.6% of Bihar’s population, are concentrated in these riverine belts, bestowing upon them higher electoral influence than their overall numbers would suggest. Any impetus to the makhana industry, which has immense unrealised potential in Bihar, will improve the earnings of Mallah farmers.\nSTORY CONTINUES BELOW THIS AD\nPause\nUnmute\n:\nFullscreen\nPolitical Pulse | Budget bonanza for Bihar: How it may play out in poll-bound state\n“The Centre’s announcement is significant,” JD(U) working president Sanjay Jha told The Indian Express. “The demand for makhana is rising internationally and Bihar is the largest producer of the seed in the country. It will not only give much-needed impetus to the makhana industry in Bihar but will also help its farmers who come from the impoverished community of fishermen. Since it is a labour-intensive industry, it will also create jobs for the community.”\nSTORIES YOU MAY LIKE\nShilpa Shirodkar explains why brother-in-law Mahesh Babu did not post for her during Bigg Boss 18, says he isn’t arrogant: ‘He is reserved’\nTaxable income of Rs 12 lakh? You will take home the same as someone with a taxable income of Rs 12.71 lakh. Here’s why.\nWhat does the Rs 12 lakh I-T rebate mean?\nAccording to Jha, the announcement has come at the right time.\n“Lately, a lot of FPOs (farmer producer organisations) have come up in Bihar. The Makhana Board, under the commerce ministry, will help in adding value to makhana produced in Bihar through training, packaging and marketing. It will also help in introducing technology to makhana farming. It will improve the earnings of farmers and the quality of life of these farmers will improve. A food processing institute is also coming up. This will further give impetus to the industry,” said the JD(U) leader.\nExplained | Focus on Bihar: Here are the schemes announced for the state in the Budget\nMallahs have traditionally sided with social justice parties in Bihar since the JP Movement. However, of late, all parties, in successive elections, have reached out to them given that they are also an assertive caste influencing other lower castes that rally behind them.\nSTORY CONTINUES BELOW THIS AD\nIn the 2020 Assembly elections, the BJP gave 11 seats to the Vikassheel Insaan Party (VIP) led by Mukesh Sahani who calls himself a “son of Mallah”. This led to the BJP settling for just 110 seats against the JD(U)’s 115. The VIP went on to win three constituencies but, importantly, managed to transfer its votes to the BJP, helping the party win 74 seats while the JD(U) ended up with 43. The latter was also dented by the Lok Janshakti Party (LJP) fielding candidates against it.\nSahani’s MLAs, however, defected to the BJP later and the relationship between the two parties soured. Since then, the VIP has been with the Rashtriya Janata Dal and contested the 2024 Lok Sabha polls as part of the INDIA bloc of Opposition parties. With the Budget announcements related to makhana, the NDA will hope to offset any influence that Sahani continues to exert on his community."
    },
    {
        "title": "Tax threshold on overseas remittances hiked to Rs 10 lakh from Rs 7 lakh",
        "link": "https://indianexpress.com/article/business/tax-overseas-remittances-hiked-education-tcs-loan-9812129/?ref=hometop_hp",
        "content": "Finance Minister Nirmala Sitharaman has proposed to increase the threshold for collecting Tax Collected at Source (TCS) on Liberalised Remittance Scheme (LRS) transactions from Rs 7 lakh to Rs 10 lakh. She also proposed to do away with the 0.5 per cent TCS on remittances for education where it is being funded by a loan.\nThe increase in threshold from Rs 7 lakh to Rs 10 lakh for collecting TCS is expected to benefit the travel and foreign exchange sectors, providing a boost to outbound tourism, education and the airline sectors.\nUnder the Liberalised Remittance Scheme, resident individuals, including minors, can freely remit up to US$ 2,50,000 per financial year for permissible current or capital account transactions. These transactions include education, medical treatment abroad, purchase of property, and investments in foreign stocks.\nSTORY CONTINUES BELOW THIS AD\nPause\nUnmute\n:\nFullscreen\nMust Read | ExplainSpeaking: Are Indians being over-taxed? Here are 5 charts on where India stands globally\nAccording to Poonam Upadhyay, Director, Crisil Ratings, the proposed hike in tax collected at source threshold on remittances under the LRS from Rs 7 lakh to Rs 10 lakh should benefit the travel and foreign exchange sectors. It will provide tailwinds for the outbound tourism and airline sector. Students and individuals seeking medical treatment will also benefit.\nSTORIES YOU MAY LIKE\nTaxable income of Rs 12 lakh? You will take home the same as someone with a taxable income of Rs 12.71 lakh. Here’s why.\nNow health insurance cover for 1 crore gig workers under Ayushman Bharat\nIncome up to Rs 12 lakh tax-free; consumption, capex key drivers\nManoj Purohit, Partner, Tax and Regulatory Services, BDO India, said rationalisation of levy of TCS on LRS by increasing the limit would increase the base for exemption and increase compliance. Also, exempting the TCS on payments made for education purposes via specified financial institutions will ease the burden on students planning to study abroad with minimal tax compliance processes.\nOutward remittances under LRS were $ 31.735 billion during the year ended March 2024. Travel has emerged as the primary source of remittance outflow from India, accounting for over 50 per cent of total outflows at $ 17 billion from just 1.5 per cent share in FY14. Student remittances were $ 3.47 billion in FY24.\nAlso Read | Aspirational India feels over-taxed and disappointed\nTCS is not an additional tax liability as people can claim a refund while filing income tax returns. As per the TCS rates under LRS proposed in the 2023-24 Budget, overseas tour package attracted TCS of 20 per cent from October 1, compared to 5 per cent. However, TCS will not be levied on credit card spending abroad. On International spends through credit cards, HDFC Bank said in a communication to account holders, “the classification of use of international credit card while being overseas, as LRS is postponed.\nSTORY CONTINUES BELOW THIS AD\nTherefore, no TCS shall be applicable on expenditure through international credit card while being overseas till further order.”\nAs of now, for education where the source of fund is a loan, there is no TCS for less than Rs 7 lakh per individual per annum; for amounts equal to or more than Rs 7 lakh, the applicable TCS was at 0.5 per cent. For education purposes where the source is self-funding, for amounts less than Rs 7 lakh no TCS will be levied, but for amounts of Rs 7 lakh and above, TCS rate was 5 per cent."
    },
    {
        "title": "8 killed in encounter between security forces and Maoists in Chhattisgarh’s Bijapur",
        "link": "https://indianexpress.com/article/india/bijapur-encounter-chhattisgarh-maoists-killed-9811982/?ref=hometop_hp",
        "content": "Eight Maoists were killed in a major gun battle between security forces and Maoists in Gangalur in Chhattisgarh’s Maoist-hit Bijapur district Saturday morning, police said.\nThis came following a joint operation undertaken by District Reserve Guard (DRG), Special Task Force (STF), battalion number 222 of Central Reserve Police Force (CRPF) and CRPF’s elite Commando Battalion for Resolute Action’s (CoBRA) number 202 battalion. According to the police, the encounter began at 8.30 am and the operation is still ongoing.\nInspector General of Police for Bastar Range Sundarraj P confirmed the development.\nSTORY CONTINUES BELOW THIS AD\nPause\nUnmute\n:\nFullscreen\nIn all, 48 Maoists have been killed in various encounters in Chhattisgarh since January 1, including the latest.\nSTORIES YOU MAY LIKE\nTaxable income of Rs 12 lakh? You will take home the same as someone with a taxable income of Rs 12.71 lakh. Here’s why.\nWhat does the Rs 12 lakh I-T rebate mean?\nUdit Narayan calls himself 'decent' after video of him kissing fans goes viral: 'Humein bhi unko khush karna hota hai'\nThe encounters come amid a major counterinsurgency push in the state, with Union Home Minister Amit Shah saying last August that “ruthless action” will be taken to eradicate Left Wing Extremism (LWE) from India by March 2026."
    },
    {
        "title": "Opinion: Union Budget 2025 will spur domestic flows to capital market, improve corporate profits",
        "link": "https://indianexpress.com/article/opinion/columns/budget-2025-multiplier-effects-corporate-profits-capital-market-9812300/?ref=hometop_hp",
        "content": "The budget has delivered a Triveni Sangam of fiscal prudence by lowering the deficit this year to 4.8 per cent of GDP and next year to 4.4 per cent of GDP below street expectations, boosting urban consumption through income tax cuts by giving a tax cut for income up to Rs 12 lakh and enhancing allocation for capital expenditure by 10 per cent at the central level and 17 including grants.\nThe budget has invested in the future by allocating Rs 10,000 crore for a start-up Fund of Fund scheme; Rs 25,000 crore for shipbuilding through a Maritime Development Fund; and Rs 20,000 crore for small modular nuclear reactors. All these investments are futuristic and could have a multiplier effect on the economy.\nYou’re just one step away from accessing this premium story.\nSubscribe Now\nAlready a subscriber? Sign in"
    },
    {
        "title": "What does the Rs 12 lakh I-T rebate mean?",
        "link": "https://indianexpress.com/article/explained/explained-economics/income-tax-rebate-9811541/",
        "content": "Income Tax Budget 2025 Explained: Finance Minister Nirmala Sitharaman has raised the limit of income tax rebate from Rs 7 lakh to Rs 12 lakh, which essentially means that if an individual has an income of up to Rs 12 lakh, she will have zero tax liability.\nDoes that mean that those earning Rs 15 lakh will have to pay tax on only Rs 3 lakh?\nNo, the rebate is only applicable for those earning up to Rs 12 lakh. If your taxable income is even a rupee more than Rs 12 lakh, you will have to pay taxes as per the slab rates under the new tax regime. Earlier, those earning up to Rs 12 lakh paid a tax of Rs 80,000 under the new tax regime.\nSTORY CONTINUES BELOW THIS AD\nPause\nUnmute\n:\nFullscreen\nThis means that if your taxable income is, say, Rs 12.1 lakh, your tax liability would be Rs 61,500.\nSTORIES YOU MAY LIKE\nTaxable income of Rs 12 lakh? You will take home the same as someone with a taxable income of Rs 12.71 lakh. Here’s why.\nRelief for taxpayer and discipline on the fisc – how Budget 2025 will play out\nNow health insurance cover for 1 crore gig workers under Ayushman Bharat\nThis is because, if your income is above Rs 12 lakh you will have to pay a tax of 5% on income between Rs 4 lakh to 8 lakh; 10% on income between Rs 8 lakh to 12 lakh and 15% between Rs 12 lakh to 16 lakh.\nSo an individual earning Rs 15 lakh will end up paying a tax of Rs 1,05,000.\nWhat is the benefit for those earning above Rs 15 lakh?\nSTORY CONTINUES BELOW THIS AD\nThe FM has provided significant savings for even those earning above Rs 15 lakh by way of sharp cut in tax rates for incomes falling between Rs 15 lakh and Rs 24 lakh.\nWhile earlier, in the new tax regime, incomes above Rs 15 lakh were taxed at 30%, the FM has proposed to tax incomes between Rs 12 lakh to 16 lakh at 15%; income between Rs 16 lakh and 20 lakh at 20%; and that between Rs 20 lakh and 24 lakh at 25%. Now, 30% rate will be applicable only for income above Rs 24 lakh.\nThe FM has announced that those earning above Rs 24 lakh will have savings of up to Rs 1.1 lakh under the new tax regime."
    },
    {
        "title": "Budget’s balancing act — and its costs",
        "link": "https://indianexpress.com/article/opinion/columns/budgets-balancing-act-and-its-costs-9812486/",
        "content": "The first full budget of the government’s third term faced an unenviable task because it confronted two objectives ostensibly at odds with each other.\nOn the one hand, the global backdrop is getting more precarious. Markets are already under the grip of US exceptionalism, which has pushed up the dollar and kept US interest rates sticky. This has tightened global financial conditions and put relentless pressure on emerging market currencies. Now, trade policy is throwing more fuel on the fire. US authorities plan to impose tariffs on Mexico, Canada and China this weekend, marking the onset of the much-feared trade war. This is expected to drive the dollar’s strength and put more pressure on emerging markets. A hostile global environment would argue for the budget to hunker down and reinforce macroeconomic stability, so that India can weather the coming storm.\nYou’re just one step away from accessing this premium story.\nSubscribe Now\nAlready a subscriber? Sign in"
    },
    {
        "title": "Dinesh Nandwana, founder of tech firm Vakrangee, dies during ED search in Mumbai",
        "link": "https://indianexpress.com/article/cities/mumbai/founder-vakrangee-dies-ed-search-mumbai-9811607/",
        "content": "Dinesh Nandwana, the 62-year-old founder, promoter and chairman emeritus of Vakrangee, a Mumbai-based technology company, died on Friday while an Enforcement Directorate (ED) team was conducting a search at his Andheri residence.\nNandwana’s health deteriorated while the central agency’s Jalandhar unit officials were conducting a search at around 11.30 am, the police said.\n“He was rushed to the hospital but died before admission. Prima facie, it looks like he had a heart attack but we are awaiting the postmortem report to ascertain the exact cause of death,” said Ravindra Chavan, Senior Inspector, MIDC police station. The police have registered an accidental death report.\nSTORY CONTINUES BELOW THIS AD\nPause\nUnmute\n:\nFullscreen\nAlso Read | Torres Ponzi scheme fraud case: ED to question arrested accused\nThe family of the deceased has not lodged any complaint, Chavan added.\nSTORIES YOU MAY LIKE\nUdit Narayan calls himself 'decent' after video of him kissing fans goes viral: 'Humein bhi unko khush karna hota hai'\nTaxable income of Rs 12 lakh? You will take home the same as someone with a taxable income of Rs 12.71 lakh. Here’s why.\nIND vs ENG 5th T20I Predicted Playing 11: Harshit Rana, Mohammed Shami in India Playing XI\nIn a letter, Vakrangee informed the Bombay Stock Exchange about Nandwana’s demise. “With deep sorrow, we hereby inform that our Promoter and Chairman Emeritus Mr. Dinesh Nandwana, aged 62 years has left us for the heavenly abode today afternoon i.e. January 31, 2025. Mr. Dinesh Nandwana was the first generation entrepreneur who played an important role in bringing the company to its present level based on very strong fundamentals,” the letter stated. The company further said that Nandwana was instrumental in moulding Vakrangee from a modest consultancy company to “a prominent force to be reckoned with”."
    },
    {
        "title": "IND vs ENG 5th T20I Predicted Playing 11: Harshit Rana, Mohammed Shami in India Playing XI",
        "link": "https://indianexpress.com/article/sports/cricket/ind-vs-eng-5th-t20i-predicted-playing-11-harshit-rana-mohammed-shami-india-9812442/",
        "content": "India vs England, IND vs ENG 5th T20I Predicted Playing 11 Today Match: India have sealed the five-match T20I series against England with a 15-run win in Pune in the fourth game.\nThat game saw some controversy over India’s choice of the concussion replacement who made an impact: pacer Harshit Rana replaced all-rounder Shivam Dube after the latter took a blow to his head while batting and Rana returned with figures of 3/33 in his maiden T20I.\nEngland were unhappy with ICC match referee Javagal Srinath allowing India Rana as replacement as India had a more like-for-like replacement in the form of Ramandeep Singh.\nSTORY CONTINUES BELOW THIS AD\nPause\nUnmute\n:\nFullscreen\nAhead of the 5th match in Mumbai, Indian Express brings you the predicted playing XIs of India and England.\nSTORIES YOU MAY LIKE\n‘Madness’: Former cricketers react to Harshit Rana-Shivam Dube concussion swap in India vs England 4th T20I\nTaxable income of Rs 12 lakh? You will take home the same as someone with a taxable income of Rs 12.71 lakh. Here’s why.\nHow Delhi cop posed as a groom ‘desperate to get married’, busted fake wedding racket\nQuestion mark over Shivam Dube\nThe Shivam Dube concussion incident will put a question mark over his participation in the 5th T20I. India could opt for Ramandeep Singh, who, like Dube, is a batting allrounder.\nOr just like the fourth T20I, India could opt for Harshit Rana.\nShami over Arshdeep?\nVeteran India pacer Mohammed Shami, who has made a comeback to the Indian team after a lengthy injury layoff, might also return to the playing XI in place of Arshdeep Singh.\nSTORY CONTINUES BELOW THIS AD\nArcher could get rested\nWith the fate of the series already decided, Jofra Archer could be rested by the visitors since he has played all four T20Is so far. In place of him, the England think tank might slot in Gus Atkinson.\nPredicted XIs for IND vs ENG game 5 at Mumbai\nIndia predicted XI for 5th T20I:\nAbhishek Sharma, Sanju Samson (wk), Suryakumar Yadav (captain), Tilak Varma, Hardik Pandya, Rinku Singh, Axar Patel, Ramandeep Singh/Harshit Rana, Arshdeep Singh/Mohammed Shami, Ravi Bishnoi, Varun Chakravarthy\nEngland predicted XI for 5th T20I:\nPhil Salt (wk), Ben Duckett, Jos Buttler (capt), Harry Brook, Liam Livingstone, Jamie Smith, Jamie Overton, Brydon Carse, Jofra Archer/Gus Atkinson, Saqib Mahmood, Adil Rashid"
    },
    {
        "title": "Budget big picture: Acknowledgement of a miscalculation, major steps to course-correct",
        "link": "https://indianexpress.com/article/explained/budget-big-picture-explained-9811786/",
        "content": "Union Budget 2025 Highlights: What is the big picture emerging from the Union Budget presented by Finance Minister Nirmala Sitharaman on February 1? What was the context of this Budget — the twelfth Budget presented by the Narendra Modi government, and how has Sitharaman addressed it?\nThe context of the Budget\nGoing into the presentation of the Union Budget 2025-26, India’s economic situation had worsened considerably.\nYou’re just one step away from accessing this premium story.\nSubscribe Now\nAlready a subscriber? Sign in\nMore Premium Stories\nPrevious\n‘A mature govt wouldn’t interfere too much with judiciary’\nWhat the Economic Survey says\nAre Indians being over-taxed? Five charts on where India stands\nNext\nUdit Misra\nFollow\nUdit Misra is Deputy Associate Editor. Follow him on Twitter @ieuditmisra\n... Read More"
    },
    {
        "title": "Historic, Modi hai toh mumkin hai: BJP on I-T relief",
        "link": "https://indianexpress.com/article/cities/kolkata/historic-modi-hai-toh-mumkin-hai-bjp-on-i-t-relief-9812799/",
        "content": "The West Bengal unit of the BJP on Saturday called the Union Budget, presented by Finance Minister Nirmala Sitharaman, “historic” for giving Income Tax relief to people.\n“Yesterday, Prime Minister Narendra Modi had hinted that there would be good news for the middle class and women… Today, in the Budget announcement, we saw that big steps have been taken that will benefit all sections of society. When Modi came to power in 2014, the Income Tax rebate was Rs 2.5 lakh. Now, this year it has been increased to Rs 12 lakh. It’s good news for the middle class. We want to say Modi hai toh mumkin hai,” BJP state general secretary Jagannath Chattopadhyay said.\n“This Budget will help the country to develop and move forward. This is a historical budget,” he added.\nSTORY CONTINUES BELOW THIS AD\nPause\nUnmute\n:\nFullscreen\nBJP’s Rajya Sabha MP Samik Bhattacharya said, “People are conscious enough to see the salient features of this Budget, including tax benefits for the middle class.”\nSTORIES YOU MAY LIKE\nChris Martin, Dakota Johnson take a dip at Mahakumbh 2025. Watch\nUdit Narayan calls himself 'decent' after video of him kissing fans goes viral: 'Humein bhi unko khush karna hota hai'\nTaxable income of Rs 12 lakh? You will take home the same as someone with a taxable income of Rs 12.71 lakh. Here’s why.\nUnion minister and senior BJP leader Sukanta Majumdar said, “Sitharaman ji has presented a dynamic, people-friendly budget as the middle and the lower-middle class have been given great relief under the new I-T regime.”\nLeader of Opposition in Assembly, Suvendu Adhikari, said the Union Budget focused on ‘GYAN’ (Gareeb, Youth, Annadata Farmers and Nari)”. “Thrilled to know that no income tax has to be paid up to Rs 12 lakh. Huge relief for the middle class, the consistent tax players of the country,” he said.\nCountering the TMC’s charge that there was nothing for Bengal in the Budget, Samik Bhattacharya said: “The TMC government in West Bengal has failed to ensure speedy implementation of Central projects, like the proposed airport in Malda, due to logjam in infrastructure support. The TMC should see its face in the mirror first.”"
    },
    {
        "title": "A budget for the middle class that tries to do a balancing act",
        "link": "https://indianexpress.com/article/opinion/columns/union-budget-2025-middle-class-balancing-act-9811921/",
        "content": "The Union Budget is a statement of accounts of the government, which says where money comes from and how it is spent. It is also the most potent policy instrument the government has as these numbers are drafted keeping in mind the larger goals of the economy in the areas of consumption, investment, inflation and interest rates. This year, two concerns were paramount: The first was consumption and the other was the government’s capex. In FY 25, there was a modicum of sluggishness in both. The budget has attempted to address both these issues from the fiscal side.\nThe budget has attempted to not just revive but also accelerate the processes. The income tax slabs have been moderated, which would result in Rs 1 lakh crore revenue being foregone. Intuitively, the amount in the hands of the taxpayers would be used for consumption and savings. Assuming that 70 per cent is spent, there can be expectations of higher spending by the salaried class. Typically, this would be spent on consumer goods and services. As services have been witnessing a sharp increase in recent times, it can be expected to accelerate.\nSTORY CONTINUES BELOW THIS AD\nThe other area is capex which has high multiplier effects on the economy. The focus areas are roads, railways and defence, which account for 63 per cent of the total capital expenditure — or 75 per cent, if transfers to states are excluded. The outlay for this year has almost been maintained at last year’s budgeted number of Rs 11.2 lakh crore. With a full year to operate, this time it may be expected that there will be no shortfall, which will help to speed up capex as well as bring in private investment. Industries like cement, steel and machinery are likely to benefit from these outlays.\nThe government’s capex has strong backward linkages in an indirect manner as it stimulates investment made by infrastructure industries which, in turn, employ more people. In other words, this process has a distinct connection with job creation. This will continue in FY26. The difference in approach to investment that has been spelt out in the budget is important — it focuses on the PPP model to push up capital formation. This is at the industry level — here all ministries would be involved — as well as in urban infrastructure.\nDon't miss | The Budget and its politics: Middle class, Bihar, farmers\nThe spending on social welfare deserves mention here. The government has been supporting the poor through schemes like PM-Kisan, NREGA, and PM Awas. These would continue to be focus areas. The free food scheme has received an outlay of Rs 2 lakh crore and the interests of the less privileged class have been addressed. The outlays provided in the budget will ensure that the safety net remains unaffected. This is important at a time when inflation is still a concern for all.\nSTORY CONTINUES BELOW THIS AD\nOf late, budgets have tended to keep in mind the market impact as borrowings have increased sharply after the Covid pandemic, putting pressure on the markets as funding is an issue. However, ever since the government decided to roll back the deficits, albeit gradually, the gross borrowing programme has largely been range-bound. This has meant that the squeeze on liquidity has been limited. By bringing down the fiscal deficit ratio to 4.4 per cent for FY26, the budget continues on this path. This is good for the banking sector in particular given that there are challenges in garnering deposits. The bond markets will start off on a positive note on Monday as the fiscal numbers do indicate stable bond yields.\nThe budget has assumed a conservative GDP growth — 10.1 per cent. This would ensure that growth is not overstated and with attendant spinoffs on revenue collection. In other words, the possibility of a higher revenue collection cannot be ruled out. This also means that expenditure can be incurred without cutting corners.\nMOST READ\n1\nPratap Bhanu Mehta writes: India’s delusion of relevance\n2\nRam Madhav writes: Under Modi government, Indians have reclaimed religious pride\n3\nFrom Uttarakhand’s UCC to Noida colony: Why do men in authority care so much about young lovers?\n4\nTigers crossing vast distances in east-central India bring a message of hope. If only we would listen\n5\nArt can do what politics can’t. Traditional Indian arts must be celebrated\nOn the tax collections side, the buoyancy seen in income tax collections would continue this year. Revenues would rise by about 10 per cent, notwithstanding the concessions given in the budget. Corporate tax collection would increase by a similar amount which indicates that profits of companies would improve next year, which is good news.\nOn the whole, the Finance Minister has managed the budget quite dexterously given the limited space that was available since the objective of keeping to the agenda of lowering the fiscal deficit was paramount. It does appear to have the middle class in mind which will be the biggest beneficiary of these announcements. Funds have been channeled to areas which need attention as well as to areas where there would be growth multipliers (capex). More importantly, this has been done by ensuring that liquidity in the system is not affected which is a concern today given that the RBI regularly invokes enabling measures to ease the deficit.\nSabnavis is Chief Economist, Bank of Baroda and author of Corporate Quirks: The darker side of the sun. Views are personal"
    },
    {
        "title": "Sambhal violence: Video call to Pakistani maulvi goes viral, UP man held for endangering unity of India",
        "link": "https://indianexpress.com/article/cities/lucknow/sambhal-violence-video-call-pakistani-maulvi-up-man-9811734/",
        "content": "A 24-year-old man in Uttar Pradesh’s Sambhal district was arrested on Thursday on charges of endangering the sovereignty, unity, and integrity of India after a video of him allegedly speaking to a maulana in Pakistan on the Shahi Jama Masjid issue went viral.\nMohammed Aqil was arrested from Mirzapur Narullapur village and booked under Section 152 of the Bharatiya Nyaya Sanhita, a non-bailable offence, after a police official lodged a complaint against him at Bahjoi police station in Sambhal. He was produced before a local court on Friday and sent to jail.\nAccording to Shrish Chandra, assistant superintendent of police (ASP), Sambhal, Aqil spoke to Pakistan-based maulvi Mohammed Ali Mirza on January 15, asking him whether or not those who died in the violence that broke out in Sambhal on November 24 last year after a court-ordered survey of the local Shahi Jama Masjid should be called martyrs.\nSTORY CONTINUES BELOW THIS AD\nPause\nUnmute\n:\nFullscreen\nExplained | Places of Worship Act, and the legal issues in the Sambhal mosque case\n“He also raised questions on the role of the police in containing the violence that day. The contents of the video call and the mobile chat with the maulvi are in our possession. This has hurt the sentiments of the people and denigrated the image of the country,” ASP Chandra added.\nSTORIES YOU MAY LIKE\nTaxable income of Rs 12 lakh? You will take home the same as someone with a taxable income of Rs 12.71 lakh. Here’s why.\nArmed with a foreign degree, engineer ran PhD admissions racket; arrested\nUdit Narayan calls himself 'decent' after video of him kissing fans goes viral: 'Humein bhi unko khush karna hota hai'\nFive people died and several others, including police personnel, were injured during the violence. The survey was ordered to ascertain if the mosque had been built after destroying a temple following a petition filed before a local court.\nASP Chandra said that the police have Aqil’s mobile phone and are checking if he was in contact with other people from Pakistan. “We are also investigating if he was involved in the violence in the town in November,” he added."
    },
    {
        "title": "Gujarat gang of hackers has accomplices in major Indian banks: Crime Branch",
        "link": "https://indianexpress.com/article/cities/ahmedabad/gujarat-gang-of-hackers-has-accomplices-in-major-indian-banks-crime-branch-9812617/",
        "content": "The Detection of Crime Branch (DCB) of Ahmedabad city police that busted a three-member gang of hackers on Thursday, has now said that the accused have accomplices in at least four major corporate banks who helped them crack the alphanumeric code during the transaction process. of a gaming platform. It said that the accused not only made illicit gains by hacking websites of various companies, but also duped players of online betting platform RummyCircle.\nTheir accomplices, as per the DCB, helped the hackers dupe players of the gaming platform by sending them unique transaction reference (UTR) codes. UTR is an alphanumeric code, which is generated when money is digitally transferred from one bank account to another. DCP (Crime) Ajit Rajian said that the gang members lured the bank employees with money. The names of these banks have been withheld by The Indian Express on request of investigators.\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in"
    },
    {
        "title": "Day after new chief secretary takes charge, 64 IAS officers transferred",
        "link": "https://indianexpress.com/article/cities/ahmedabad/day-after-new-chief-secretary-takes-charge-64-ias-officers-transferred-9812667/",
        "content": "In a major reshuffle in the state bureaucracy, the Gujarat government Saturday notified the transfer of 64 IAS officers along with promotions, appointing Banchhanidhi Pani as Ahmedabad Municipal Commissioner and handing over additional charge to Avantika Singh Aulakh as Managing Director of Gujarat Alkalies and Chemicals Limited.\nThe IAS transfers come a day after Pankaj Joshi took over charge as Chief Secretary of Gujarat. Commissioner of Land Reforms and ex-officio Secretary to government, Revenue Department, P Swaroop has been transferred and appointed as Industries Commissioner, taking over charge from Sandip Sagale, who will take over as Director General of Sports Authority of Gujarat (SAG). SAG Director RS Ninama has been transferred to be appointed as Secretary of Gujarat State Human Rights Commission.\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in"
    },
    {
        "title": "How Delhi cop posed as a groom ‘desperate to get married’, busted fake wedding racket",
        "link": "https://indianexpress.com/article/cities/delhi/how-delhi-cop-posed-as-a-groom-desperate-to-get-married-busted-fake-wedding-racket-9812710/",
        "content": "For years, a husband-wife duo allegedly lured unsuspecting bachelors in Delhi into the promise of marriage — only to rob them of their money and vanish. Even as the police were hot on their trail, they absconded and evaded arrest for five years. The chase finally ended when a Crime Branch officer, posing as a desperate groom, set a trap and arrested them in Jahangirpuri on Friday, said officers.\nPolice said the couple has two children and was leading a low-profile life, with the man working as an e-rickshaw driver in Jahangirpuri to evade arrest.\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in"
    },
    {
        "title": "Watch: Rishi Sunak greets audience with ‘Namaste’ at Jaipur Literature Festival",
        "link": "https://indianexpress.com/article/world/rishi-sunak-jaipur-lit-fest-namaste-video-9812290/",
        "content": "Former UK Prime Minister Rishi Sunak made a surprise appearance at the Jaipur Literature Festival (JLF) on Saturday, joining his in-laws, Infosys co-founder Narayana Murthy and author-turned-MP Sudha Murty, in the front row.\nSunak’s wife, Akshata Murty, and her mother, Sudha Murty, were scheduled to speak at a session titled “My Mother, Myself.” As the event host acknowledged the presence of “two wonderful people—Narayana Murthy and former Prime Minister Rishi Sunak,” cheers erupted from the audience."
    },
    {
        "title": "Why I stopped listening to music—and how I’m finding my way back",
        "link": "https://indianexpress.com/article/express-sunday-eye/why-i-stopped-listening-to-music-and-how-im-finding-my-way-back-9809558/",
        "content": "People often ask me why I don’t listen to music anymore. The question is always so innocent, so unassuming. Tossed my way in casual conversation, it lingers like an afterthought, but to me, it is anything but. It lands heavy, presses against my ribs, stirs things I don’t always have words for.\nHow do I explain it? That sound—once my sanctuary, my scripture, my solace—has turned into something wild and unwieldy, something I must brace myself against. That even the gentlest note, the softest murmur, can pull me apart at the seams. That I hold phone calls on speaker, keeping the device at a distance, not out of preference, but because sound, any sound, swarms me, fills me, unmoors me.\nYou’re just one step away from accessing this premium story.\nSubscribe Now\nAlready a subscriber? Sign in\nMore Premium Stories\nPrevious\n‘A mature govt wouldn’t interfere too much with judiciary’\nWhat the Economic Survey says\nAre Indians being over-taxed? Five charts on where India stands\nNext"
    },
    {
        "title": "10 incredible animals you may never see again",
        "link": "https://indianexpress.com/article/lifestyle/pets-animals/10-incredible-animals-you-may-never-see-again-9713283/",
        "content": "Climate change and industrialisation have pushed multiple extraordinary animals on the planet towards extinction.\nAmongst the ever-growing list of animals that are going to be extinct, here are the ones we may never see again.\nYou have exhausted your monthly limit of free stories."
    },
    {
        "title": "Ukraine, Russia accuse each other of deadly strike on boarding school in Kursk region",
        "link": "https://indianexpress.com/article/news-today/ukraine-russia-accuse-deadly-strike-boarding-school-kursk-region-9812833/",
        "content": "Ukraine and Russia traded blame for a deadly missile strike on Saturday that killed at least four people in the dormitory of a boarding school situated in a part of Russia’s Kursk region held by Kyiv forces.\nSome of the war’s fiercest battles in recent months have been taking place in the Kursk region that borders Ukraine, where Kyiv forces have held swathes of the land since staging a major cross-border incursion last August."
    },
    {
        "title": "Trump imposes new tariffs on Canada, Mexico and China over fentanyl, immigration",
        "link": "https://indianexpress.com/article/world/trump-imposes-tariffs-on-canada-mexico-china-fentanyl-immigration-9812817/?ref=latestnews_hp",
        "content": "US President Donald Trump on Saturday imposed 25% tariffs on imports from Canadian and Mexican goods, and ordered a 10% tariff on Chinese goods, fulfilling one of his key election promises and declared that the tariffs would remain in place until a national emergency regarding drug fentanyl and illegal immigration in the US ends.\nOfficials from the Trump administration said that energy products from Canada, including oil, natural gas and electricity will be levied 10% tariff but Mexican energy imports will be charged 25% duty."
    },
    {
        "title": "As AAP lags and Congress faces rout in Delhi, a jab from Omar: ‘Aur lado’",
        "link": "https://indianexpress.com/elections/delhi-election-results-2025-omar-abdullah-meme-india-alliance-9824270/?ref=hometop_hp",
        "content": "As results for the Delhi Assembly elections started trickling in, and BJP edged past the halfway mark as per early trends, Jammu and Kashmir Chief Minister Omar Abdullah Saturday took a dig at his INDIA alliance partners.\nThe Aam Aadmi Party, which has a lead in 30 seats in the 70-member Assembly at present, and the Congress decided to go their separate ways in the Delhi polls – a decision that appears to have benefited the BJP.\nIn a post on X alongside a GIF that shows a sadhu saying “Ji bhar kar lado (fight to your heart’s content)”, Omar said, “Aur lado aapas mein!!! (Keep fighting amongst yourselves).”\nSTORY CONTINUES BELOW THIS AD\nThe Chief Minister has been critical of rifts within the alliance earlier too, stating that if the alliance was only for the parliamentary elections, “it should be wound up”.\nHe also underscored that if the alliance is also meant for Assembly elections, “we will have to sit together and work collectively.”\nOmar had made these statements while pointing out that the alliance partners have not convened since the Parliament elections.\nAlthough the parties contested the 2024 Lok Sabha poll together, the AAP and Congress have been critical of each other while contesting the Delhi election, where they have been rivals since AAP’s foray into politics in 2013. During the campaign too, they had frequently traded barbs and targeted each other’s leadership.\nSTORY CONTINUES BELOW THIS AD\nThe Congress and the National Conference are partners in the J&K government. However, Congress has refrained from joining Omar’s cabinet, stating that they will stay out of power in J&K till statehood is restored."
    },
    {
        "title": "‘Normalise Indian hate’: DOGE staffer resigns over racial posts",
        "link": "https://indianexpress.com/article/world/normalise-indian-hate-doge-staffer-resigns-over-racial-posts-9823863/?ref=hometop_hp",
        "content": "A KEY staff member of US President Donald Trump’s newly created Department of Government Efficiency or DOGE, headed by Elon Musk, resigned Thursday owing to racial social media posts, including against India, The Wall Street Journal has reported.\nMarko Elez, 25, deployed by DOGE to scrutinise federal spending, resigned after The Wall Street Journal asked the White House about his connection to the deleted social media account, said the report.\n“Just for the record, I was racist before it was cool,” the account posted in July, according to the WSJ’s review of archived posts.\nSTORY CONTINUES BELOW THIS AD\n“You could not pay me to marry outside of my ethnicity,” the account wrote on X in September, according to the report. “Normalise Indian hate,” the account wrote the same month, in reference to a post noting the prevalence of people from India in Silicon Valley.\nLater, White House spokesperson Karoline Leavitt said that Elez had resigned from his role.\nIn recent days, Elez had also emerged at the centre of a legal battle over access to sensitive taxpayer information and systems the Treasury Department uses to process trillions of dollars in payments annually.\nOn the day Elez quit, a US District Court judge also ruled that he could continue to access the department’s payment systems, but limited his ability to share the data.\nSTORY CONTINUES BELOW THIS AD\nElez majored in computer science from Rutgers University. He co-founded Unimetrics.io, which aimed to connect high-schoolers with mentors who could help burnish their college applications.\nElez worked for Musk at SpaceX, including on its Starlink satellites, and X, where he focused on artificial intelligence, according to archives of his personal website quoted by WSJ.\nMusk, who also owns Tesla, besides X and SpaceX, had recently weighed in to favouring the hiring of H-1B visa-holders and said he “will go to war” on the issue and asked right-wingers to “take a big step back”. The H-1B programme allows businesses in the US to employ skilled foreign nationals."
    },
    {
        "title": "India's junior athletes will no longer get cash prizes for international medals after govt amends policy",
        "link": "https://indianexpress.com/article/sports/sport-others/govt-ends-cash-awards-for-junior-athletes-to-curb-doping-age-fraud-9823902/?ref=hometop_hp",
        "content": "Junior athletes winning international medals will no longer receive cash awards from the government. This major Sports Ministry policy shift, which came into effect on February 1, is aimed at tackling the twin menace of doping and age fraud as well as “keeping the hunger of youngsters alive”.\nAccording to the old system, a gold medal at the Junior World Championship would fetch an athlete approximately Rs 13 lakh while a top of the podium finish at Asian or Commonwealth had a cash prize of Rs 5 lakh.\nA Sports Ministry official said one of the key factors behind this decision was to promote junior competitions as developmental events rather than making it all about a podium finish.\nSTORY CONTINUES BELOW THIS AD\n“We noticed that only India follows a model where junior championships are given over-importance. As a result, we have noticed that athletes work so hard at this level that by the time they reach the elite stage, they are either burnt out or have lost the hunger,” the official said.\nThe award policy for senior athletes, too, has seen a rewrite. The Ministry has removed Commonwealth Championship and South Asian Games from the events on the award list. Chess players winning International Master or Grandmaster norms, too, will no longer be incentivised.\nIn an apparent change of stance, following shooter Manu Bhaker’s unprecedented two bronze medals at last year’s Paris Games, sportspersons and their coaches will now be rewarded for “each medal won” at the Olympics and World Championships. Akhara or academy where a medalist trained will be eligible for awards as well. The clause that barred an athlete’s “spouse, father, mother, brother and sister” from receiving the award has been removed from the revised policy.\nOver the years, cash incentives were seen as one of the reasons that pushed the athletes and their coaches into committing age fraud and doping offences. According to National Anti-Doping Agency data as of January 13, more than 10% of the dope offenders in India since 2022 are minors — 22 out of 204.\nSTORY CONTINUES BELOW THIS AD\nAnd while there is no central system monitoring the number of athletes who fudge their age, hundreds have been suspended over the few years across sports — with many more escaping the net.\n“It can be said that the cash awards are one of the reasons athletes are lured into adopting unfair means. Most of them come from humble backgrounds, so it is a case of high risk, high reward for them,” said another official.\nThe decision to drop events like the Commonwealth Championship and South Asian Games, too, was taken to ensure athletes remain focused on competing in tougher and more important international events, like the continental and world cups/championships.\nMeanwhile, athletes winning events like the All-England Badminton Championship or the Candidates Tournament in chess will be given the same amount of cash prize as World Championship winners, given the high standard of competition there."
    },
    {
        "title": "Ravindra Jadeja and Axar Patel - never club them together, never write them off",
        "link": "https://indianexpress.com/article/sports/cricket/ravindra-jadeja-and-axar-patel-never-club-them-together-never-write-them-off-9824111/?ref=hometop_hp",
        "content": "Ravindra Jadeja and Axar Patel possess cricket skills that get labelled similarly. But that’s like confusing tomato sauce for ketchup. Or a crow for a raven. It needs an expert eye and nose for nuance to appreciate the difference between the all-format multi-skilled cricketers. They have the same font but Jadeja is italicized.\nTo bracket them as a fastish spinner is to dovetail Jasprit Bumrah and Mohammad Shami as identical 140 plus quicks. The taller Axar banks on bounce and drift. Jadeja, easily the better-skilled tweaker, also has the drift but possesses a bigger break, deadlier skidder and a more surprising armer.\nYou’re just one step away from accessing this premium story.\nSubscribe Now\nAlready a subscriber? Sign in\nMore Premium Stories\nPrevious\nThe rise of India’s premier boarding schools\nAnand Neelakantan: 'Many Ramayanas, Many Lessons'\nDelhi to Mexico: A man’s harrowing journey ends in deportation\nNext"
    },
    {
        "title": "As groom’s mom and uncle set the dance floor on fire, the Internet calls them ‘Real-life Monica and Ross’",
        "link": "https://indianexpress.com/article/trending/trending-in-india/viral-groom-mom-uncle-wedding-dance-monica-ross-9824437/?ref=latestnews_hp",
        "content": "At a recent wedding celebration, a groom’s mother and uncle stole the spotlight with their high-energy dance performance, leaving guests, and the Internet, in awe.\nDressed in elegant traditional outfits, the duo lit up the dance floor with their electrifying moves to Jai Jai Shivshankar, the hit song from War starring Hrithik Roshan and Tiger Shroff. Their coordination was flawless, their enthusiasm unmatched, and their energy so infectious that the entire crowd erupted in cheers.\nThe video of their performance has taken social media by storm. The caption perfectly summed it up: “Groom’s mom and uncle = Dance floor legend.” Age was no barrier for these two as they danced their hearts out, proving that joy knows no limits when the music starts playing.\nWatch their electrifying dance here:\n  View this post on Instagram\n  A post shared by KITZvision (@kitz_vision)\n  STORY CONTINUES BELOW THIS AD\nThe video, shared on Instagram, is on the verge of hitting five million views. The comments section is filled with love, excitement and humour, proving just how much netizens enjoyed the performance.\nAlso Read | Dehradun school’s farewell party breaks the Internet; students’ performance on ‘Aankhein Khuli’ leaves everyone in awe\nOne user said, “Pure dulhan samaj me dar ka mahol hai (The bride’s side is in fear.)” Another user commented, “Todays youngsters forget that these uncles and aunts are the same generation as that of the ‘khans’ or aishwarya or shilpa Shetty etc etc and when the stars can dance so can the parents.”\nA third user wrote, “Husband boring ho chalega, par in-laws fun hona chaiye!” A fourth person commented, “Red bull needs aunty ji.”"
    },
    {
        "title": "Gujarat Confidential: The Coldplay ‘Bar’",
        "link": "https://indianexpress.com/article/cities/ahmedabad/gujarat-confidential-the-coldplay-bar-9824443/?ref=latestnews_hp",
        "content": "Congratulating the police over the success of the Coldplay concert, Minister of State for Home Harsh Sanghavi asked them to prepare an SOP for organising events of a similar scale. During an event at the Ahmedabad police commissionerate held on Friday, almost two weeks after the concert, Sanghavi said the glitch-free event on January 25-26 had become an example “at the international level”. The minister said that for the first time an initiative of inviting families of the police personnel was also taken in this concert. According to Sanghavi, the concert had done business worth Rs 400 crore and had created jobs for people from Ahmedabad, Gandhinagar and Mehsana.\nMatter of Time\nAs the news about the Gujarat government decision to withdraw nine criminal cases registered related to Patidar quota agitation in the state started making rounds on news channels and social media platforms Friday, a senior bureaucrat of the state government expressed surprise over the interest it aroused among people. The officer asked, “Isn’t it (decision to withdraw the cases) expected? Why are people so curious about it? The main leader of the agitation (referring to Hardik Patel) has joined the ruling party. He has even been given a party ticket and elected as MLA. So, the government would certainly reciprocate. It was just a matter of time. Isn’t it?”"
    },
    {
        "title": "Knowledge Nugget: Why ‘Dunki Routes’ used by deported immigrants from US matter for UPSC exam",
        "link": "https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/knowledge-nugget-dunki-routes-upsc-deportation-usa-h1-b-immigration-9823168/?ref=latestnews_hp",
        "content": "Take a look at the essential concepts, terms, quotes, or phenomena every day and brush up your knowledge. Here’s your knowledge nugget for today.\nKnowledge Nugget: Dunki route – illegal immigrants\nSubject: International Relations and Indian Society\n(Relevance: Migration is an important part of the UPSC syllabus. It is a broad issue encompassing factors leading to internal and external migration, reasons for illegal migration, and government policies. In 2015, a question was asked about the trends in labor migration in India. In the present context, the issue of migration has broader implications for India-USA relations, especially with the coming of Trump 2.0. Therefore, it is important to have a holistic understanding of this topic.)\nWhy in the news?\nA US military aircraft carrying 104 deported Indian nationals landed at Amritsar airport on 5th February 2025. According to the deportees, they spent between Rs 30 lakh and Rs 1 crore in expenses and agent fees in their efforts to reach the US, mostly through what is known as the “dunki route”.\nThis premium article is free for now.\nRegister to continue reading this story\nFree Read\nAlready have an account? Sign in"
    },
    {
        "title": "Thandel box office collection Day 1: Naga Chaitanya delivers his biggest opening since Love Story, romantic drama earns Rs 10 crore",
        "link": "https://indianexpress.com/article/entertainment/telugu/thandel-box-office-collection-day-1-naga-chaitanya-sai-pallavi-biggest-opener-10-crore-9824332/?ref=latestnews_hp",
        "content": "Thandel Box office Collection Day 1: Thandel marks the reunion of Sai Pallavi and Naga Chaitanya after the success of their previous film, Love Story, helmed by Sekhar Kammula. This Chandoo Mondeti project is a love story as well, and was released to much fanfare on February 7. Backed by Geetha Arts, Thandel was expected to open big, and that’s exactly what happened on Friday as the film has reportedly made Rs 10 crore on day one, with almost Rs 9.8 crore coming in from the Telugu version, according to industry tracker Sacnilk.\nALSO READ: Vidaamuyarchi box office collection Day 2: Ajith-Magizh Thirumeni’s film drops to single-digits after major dip, earns Rs 8.75 crore\nThis is one of the best openers for Naga Chaitanya in a while, since his recent releases, like Custody and Thank You, made under Rs 4 crore on day one. Thandel, which was also released in Tamil and Hindi, didn’t really make an impact in these centres due to the already crowded release window in these states, with a number of films releasing on the same day.\nSTORY CONTINUES BELOW THIS AD\nThandel had an impressive 53.58% occupancy for the Telugu version, and the almost 71% occupancy for the night shows is a fair indicator of things to come. The numbers for Thandel might improve over the weekend. The Hindi version had a dismal 9.13% occupancy, mainly because of films like Loveyapa and Badass Ravikumar being released on the same day. Shahid Kapoor’s Deva is also doing slow business. The Tamil version of Thandel had a similar 9.1% occupancy, but it was bulldozed by the much wider release of Ajith Kumar’s Vidaamuyarchi, which would be the first choice for many.\nThandel, which is based on the real-life story of Srikakulam fisherfolk being captured by Pakistani authorities for trespassing into their waters, features Aadukalam Naren, Divya Pillai, Karunakaran, and Prithviraj in pivotal roles. With music by Devi Sri Prasad and cinematography by Shamdat, the film has received mixed to positive reviews from critics and audiences. SCREEN’s Avinash Ramachandran wrote, “When the film focusses on the ups and downs of Sai Pallavi-Naga Chaitanya relationship, it sails quite smoothly, but the moment the film enters the murky waters of Pakistan, Thandel turns into a heroic tale of unlikely heroes, whose sorrow gets lost in the heroism.”\nALSO READ: Thandel movie review: Naga Chaitanya, Sai Pallavi shoulder a layered romance but get bogged down by superficial drama\nThandel marks director Chandoo Mondeti’s third collaboration with Naga Chaitanya after Premam and Savyasachi. Apart from this project, Naga Chaitanya has an interesting lineup of films, including one with Virupaksha director Karthik Varma."
    },
    {
        "title": "Not over yet: In more than a dozen seats, the AAP-BJP contest is still too close to call",
        "link": "https://indianexpress.com/article/cities/delhi/delhi-election-results-2025-aap-bjp-contest-close-to-call-9824388/?ref=latestnews_hp",
        "content": "Of the 70 seats where the Election Commission of India trends have started coming in, the margins are under 2,000 votes in 18 seats. The BJP is ahead in 40 seats and the AAP in 30.\nThese include New Delhi, where AAP chief Arvind Kejriwal is ahead of BJP’s Parvesh Sahib Singh by just over 220 votes after four rounds. AAP’s Rakhi Birla is leading by under 100 votes in Madipur.\nSeats where the margins are low also include Rohini, where BJP’s Vijender Gupta is leading; Jangpura, where BJP’s Tarvinder Singh Marwah is ahead of AAP’s Manish Sisodia; and Malviya Nagar, where BJP’s Satish Upadhyay is ahead of AAP’s Somnath Bharti.\nSTORY CONTINUES BELOW THIS AD\nThe Congress is yet to gain a lead in any seat so far, as per early trends.\nAs per ECI data, the BJP’s vote share at the moment is around 48%, while AAP’s is 43%. The Congress has a nearly 8% vote share.\nIn 2020, the AAP vote share was 54%, the’s BJP 38%, and the Congress’s around 4.5%.\nIf the trends hold, the BJP and Congress appear to have eaten into the Aam Aadmi Party’s vote share.\nSTORY CONTINUES BELOW THIS AD\nThe battle for Delhi is a matter of prestige for the Bharatiya Janata Party, as it was neither in power in the state (since 1998) nor in the municipal corporation (since 2022). The AAP, on the other hand, is facing turbulent times with its entire leadership having gone in and out of jail in the Delhi Excise Policy case, its MLAs and leaders quitting and joining other parties, and several of its prominent leaders likely to lose their seats.\nMost of the AAP candidates that are locked in close battles, including Kejriwal, are three-time MLAs. The others are Manish Sisodia, who changed his seat from Patparganj to Jangpura, Saurabh Bharadwaj from Greater Kailash and Sahi Ram Pehelwan from Tughlakabad.\nAAP Delhi Convenor and former environment minister Gopal Rai, with around 23,000 votes, is more comfortably placed. He was ahead of his BJP rival Anil Kumar Vashisht, with a margin of over 9,000 votes after the fifth round of voting in Babarpur.\nOne of the latest entrants to the seven-member Delhi council of ministers, Sultanpur Majra MLA Mukesh Ahlawat, closing in on 15,000 votes, also had a lead of more than 3,600 over the BJP’s Karam Singh Karma following four out of 15 rounds of counting.\nSTORY CONTINUES BELOW THIS AD\nDelhi Assembly Election Results 2025 | As AAP falls behind, middle class shift appears to have dented party\nDelhi Food and Civil Supplies Minister Imran Hussain, with almost 15,000 votes, managed a lead of a little over 1,600 against the BJP’s Kamal Bagri from Ballimaran at the end of four of 12 rounds of counting.\nDelhi Chief Minister Atishi was trailing behind BJP’s Ramesh Bidhuri in Kalkaji with a margin of over 1,000 votes at the end of the third out of 12 rounds of counting.\nIn Jangpura, after trailing for one round, former Delhi Deputy CM Manish Sisodia, with over 7,800 votes, took a lead of more than 2,300 votes against BJP’s Tarvinder Singh Marwah.\nIn Greater Kailash, Delhi Health Minister Saurabh Bharadwaj, with more than 8,700 votes, was trailing behind the BJP’s Shikha Rai with a margin of more than 2,500 following three out of 14 rounds of counting.\nSTORY CONTINUES BELOW THIS AD\nRaghuvindr Shokeen, the Nangloi Jat AAP MLA who was the last entrant into the Delhi cabinet in December last year, with a little more than 10,400 votes, was trailing behind the BJP’s Manoj Kumar Shokeen by a margin of more than 2,700 at the end of the third of 17 rounds of counting."
    },
    {
        "title": "Congress blanked out in Delhi again, but in AAP loss, sees some gains",
        "link": "https://indianexpress.com/article/political-pulse/congress-delhi-aap-india-bloc-9824386/?ref=latestnews_hp",
        "content": "It seems ironic and counterintuitive on a day that the Congress is staring at a humiliating fourth consecutive defeat in Delhi. However, the party is seeing a silver lining in the possible setback for the Aam Aadmi Party (AAP).\nThe demise of the AAP, the Congress believes, is the only path to its revival in the long term in the national capital, which was once its citadel.\nThe flip side of it, of course, is the resentment within the INDIA bloc, many of whose members feel the Congress should have joined hands or aligned with the AAP to take on the BJP.\nSTORY CONTINUES BELOW THIS AD\nMust Read | ‘Confident of Delhi win’, AAP keeps options, doors open for Congress\nTo this, the Congress has been arguing that it was the AAP which did not want an alliance with it, and that Arvind Kejriwal himself spelt that out clearly with the AAP first off the block announcing all its 70 candidates.\nHowever, many INDIA bloc parties believe a victory for the BJP in Delhi, coming on the heels of its smashing wins in Haryana and Maharashtra, will help it overcome the Lok Sabha setback and weave a political narrative once again that it is electorally invincible and that Narendra Modi is still as popular as he was – a message which the Opposition alliance cannot afford.\nEspecially since the Opposition has to take on the BJP in Bihar later this year and the all-important West Bengal next year.\nThe Congress, however, believes the party has to claw back in states to revive nationally. For Delhi, it feels, that means knocking out the AAP.\nSTORY CONTINUES BELOW THIS AD\nAs per preliminary indications Saturday, the Congress hadn’t taken much off the AAP vote share, barely adding to the 4.26% it got last time. Now, the party will be seeing whether its candidates polled more votes than the margin of victory in seats where the AAP has lost to the BJP.\nStill, Congress insiders say, their decision to go on the offensive against the AAP was correct as it had sensed “anger building up against the AAP”. Towards the end days of the Delhi campaign, all Congress top leaders including Rahul Gandhi and Priyanka Gandhi Vadra attacked the AAP.\nThis calculation is also based on the logic that the BJP has a captive vote bank in the Capital, with its vote share remaining more or less between 32% and 38% in the Assembly elections since 1993, and that it largely does not overlap with the Congress’s.\nThe Congress was in power in Delhi from 1998 to 2013. In 2008, when the party won Delhi for the third consecutive time, its vote share was 40.31%, which plunged to 24.55% in 2013 and under 10% in 2015. In 2020, it managed to get just 4.26% vote share.\nSTORY CONTINUES BELOW THIS AD\nOn the other hand, the AAP’s vote share in 2013 was 29.49%, went up to 54.34% in 2015 and was 53.57% in 2020.\nThe BJP’s was 33.07% in 2013, dipped a bit to 32.19% in 2015 but went up to 38.51% in 2020.\n“This shows that the Congress support base has moved lock, stock and barrel to the AAP. So knocking out the AAP is key for our revival,” a Congress leader said before the results.\nThe Congress calculation also is that unlike the BJP and Congress, which have a cadre base, a largely volunteer-driven party like the AAP – which was the product of a movement – would wither away once out of power. “We know the Muslims did not vote for us, a large section of our old support base still voted for the AAP and that only a small section may have come back to us this time. But the AAP will struggle to sustain once out of power,” one leader said.\nSTORY CONTINUES BELOW THIS AD\nHowever, the Congress’s hope that a double digit vote share may revive its fortunes in the INDIA bloc seemed to be getting belied Saturday morning. “If it happens, the allies will have to accommodate us and give us a decent number of seats,” a leader had said before the results.\nThe immediate impact would be in Bihar, which goes to elections next. The Congress is already perceived as the weak link in the RJD-led Mahagathbandhan, and in the 2020 Assembly elections, was believed to have dragged down the alliance. If its prospects remain dismal in the Capital, allies won’t cut it any slack in Bihar.\nStill, there will be some sweet revenge in an AAP defeat. It was the Anna Hazare movement, of which Kejriwal was a part, which was instrumental in creating the strong anti-UPA mood across the country that eventually led to the BJP victory in 2014. And the start of a Congress collapse that remains unchecked."
    },
    {
        "title": "Delhi Election Results 2025 Live Streaming: Watch Live vote counting updates here",
        "link": "https://indianexpress.com/elections/delhi-election-results-2025-live-stream-watch-9824198/?ref=latestnews_hp",
        "content": "Delhi Election Results 2025 Live Streaming: Delhi decides today! The counting of votes is underway for the 70 assembly seats at stake in the national capital. The edge-of-the-seat electoral battle culminates with the verdict on who wins the Capital conest between the Bharatiya Janata Party (BJP), which is looking to stage a comeback in Delhi after 27 years and the Arvind Kejriwal-led incumbent Aam Aadmi Party (AAP) seeking a fourth victory.\nDelhi Election Results 2025 LIVE Counting Updates: Check here\nThe exit polls following the voting day on February 5 overwhelmingly predicted a victory for the BJP, winning roughly around 40-45 of the 70 seats. The AAP, meanwhile, struggled to go past the majority mark of 36, according to most pollsters. The Congress continues to languish with almost no seats.\nJoin us LIVE as we bring you all the action and analysis of the results as they come in — from the numbers to the winners and losers."
    },
    {
        "title": "R Ashwin on Rohit Sharma’s critics: ‘When will they stop? When he performs’",
        "link": "https://indianexpress.com/article/sports/cricket/r-ashwin-on-rohit-sharmas-critics-when-will-they-stop-when-he-performs-9824348/?ref=latestnews_hp",
        "content": "Former India off-spinner R Ashwin has raised concern over Rohit Sharma’s current form and said the Team India captain must silence his critics with his performance with the bat. After an abysmal Border-Gavaskar Trophy, where he dropped himself from the final Test in Sydney. However, Rohit’s poor form continues as he managed on two runs in the opening game of the three-match ODI series in Nagpur.\n“This is not easy. If you look at it from Rohit’s point of view, then obviously, it is frustrating form him,” Ashwin said on his Youtube channel.\n“He needs to concentrate on the series. He thinks that he have done well in the format and he’d like to continue that.\nSTORY CONTINUES BELOW THIS AD\n“But people will ask questions. The ones who are watching will obviously ask.\n“It’s a catch-22 situation. You can’t stop these questions. When will they stop? When he performs,” he said.\nRohit Sharma was miffed when asked about his form heading into the ODI series against England. (BCCI)\nEarlier this week, Rohit Sharma didn’t seem too pleased with questions on his current form and his future after the ICC Champions Trophy in the press conference on the eve of the first ODI against England in Nagpur.\n“What kind of a question is that? This is a different format, a different time. As usual, as cricketers, we know there will be ups and downs and I have faced a lot in my career, so this is nothing new to me. We know every day is a fresh day, every series is a fresh series,” Rohit shot back.\nSTORY CONTINUES BELOW THIS AD\nIt was unlike any Rohit press conference one has seen over the years. Even after India were bowled out for 46 against New Zealand last year, the India captain had come for the presser and answered all questions coolly.\n“How is it relevant that I talk about my future plans sitting here when there are three ODIs and a Champions Trophy coming up. Reports have been going around for a number of years, but I am not here to clarify those reports. For me, these three games and the Champions Trophy are very important, so my focus is on these games. We will see what happens afterwards,” Rohit had said.\nIndia will play their second match against England in Cuttack on Sunday."
    },
    {
        "title": "Propose Day takes over the Internet as social media celebrates Valentine’s Week",
        "link": "https://indianexpress.com/article/trending/trending-in-india/propose-day-memes-take-over-internet-social-media-celebrate-valentine-week-9824334/?ref=latestnews_hp",
        "content": "Where are the lovebirds who’ve picked their rings, mustered up courage, and are waiting for the perfect moment to drop to one knee? If you are one of them, there’s no better day than today, Saturday, February 8—Propose Day.\nAfter showering your special someone with roses yesterday, it’s time to take things up a notch. With Valentine’s Week in full swing, February 8 is all about popping the big question. And while romance is filling the air, the Internet is having its own kind of celebration—with memes, jokes, and sarcastic takes.\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in"
    },
    {
        "title": "Badass Ravikumar box office collection day 1: Himesh Reshammiya’s film beats Loveyapa despite negligible publicity, earns Rs 2.75 cr",
        "link": "https://indianexpress.com/article/entertainment/bollywood/badass-ravikumar-box-office-collection-day-1-himesh-reshammiya-film-beats-loveyapa-9824323/?ref=latestnews_hp",
        "content": "Badass Ravikumar box office collection day 1: Singer and composer Himesh Reshammiya returned to acting with his new film, Badass Ravikumar. The pastiche film hit theatres on February 7, facing off against Khushi Kapoor and Junaid Khan’s romantic comedy, Loveyapa. Despite comparatively less promotions, the film has managed to earn more than Loveyapa on opening day. Badass Ravikumar made Rs 2.75 crore on day one, according to industry tracker Sacnilk. The Khushi-Junaid film has earned Rs 1.25 crore India net.\nHimesh Reshammiya’s Badass Ravikumar is his highest opener. He previously starred in Aap Kaa Surroor (2007), which opened at Rs 1.79 crore and went on to earn Rs 12.4 crore India net. Similarly, his second film, Karzzzz (2008), opened at Rs 2 crore and earned a total of Rs 10.3 crore. These films were followed by Radio (2009), Kajraare (2010), Damadamm (2011), and The Xpose (2014). He was also part of Akshay Kumar’s 2012 film Khiladi 786, which earned Rs 97 crore worldwide after being made on a budget of Rs 35 crore.\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in"
    },
    {
        "title": "What happens to the body when you start your day with spinach juice?",
        "link": "https://indianexpress.com/article/lifestyle/health/what-happens-to-the-body-when-you-start-your-day-with-spinach-juice-9816358/?ref=latestnews_hp",
        "content": "Starting your day with an immunity booster may be the key to restoring gut health. And what better way to do so than by indulging in a glass of fresh spinach juice? Before you scrunch your nose at the thought, let us walk you through the many benefits of having this green elixir first thing in the morning. Indianexpress.com brings you expert insights on the advantages of this drink and the best ways to incorporate it into your diet.\nDeepalakshmi, a registered dietitian at The Cleft and Craniofacial Centre and Sree Balaji Medical College and Hospital, Chennai, said starting your day with spinach juice offers numerous health benefits, including hydration, detoxification, and improved digestion due to its high water and fibre content. “It helps regulate blood sugar levels, supports red blood cell production with its iron content, and boosts energy and stamina,” she said.\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in"
    },
    {
        "title": "Chances of asteroid 2024 YR4 hitting Earth just shot up: Should we panic?",
        "link": "https://indianexpress.com/article/technology/science/chances-of-asteroid-2024-yr4-hitting-earth-just-shot-up-should-we-panic-9824309/?ref=latestnews_hp",
        "content": "The chances of asteroid 2024 YR4 impacting Earth, seven years from now, have shot up. The odds have now increased to 1 in 43. Asteroid 2024 YR4 currently tops the risk list of the Center for Near Earth Object Studies Sentry. However, there is still no need to panic. While experts and scientists anticipated the probability of its impact to increase, now they also expect a chance of an impact to decrease considerably in the near future as more comes to light about the asteroid’s orbit. \nRenowned asteroid hunter David Rannkin precovered asteroid 2024 YR4 with the help of data from the Catalina Sky Survey. Precovered here stands for the process of finding images or data of an astronomical object before its official discovery. Rankin reportedly spotted images of the asteroid in archival data. Earlier this month, the odds of the space rock impacting Earth in 2023 were 1 in 83. This means the chances have now doubled. The latest figure of 1 in 43 essentially shows a 2.3 per cent chance of a strike. “That means we are still at 97.7% chance of a miss from this asteroid,” Rankin was quoted as saying by space.com. \nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in"
    },
    {
        "title": "Early trends indicate BJP win in Delhi as AAP struggles to overcome decade of anti-incumbency",
        "link": "https://indianexpress.com/article/cities/delhi/delhi-assembly-election-results-bjp-aap-congress-9824311/?ref=latestnews_hp",
        "content": "Early trends from the Election Commission indicate that the Bharatiya Janata Party could come to power in Delhi, with its candidates leading in 38 of 65 seats where at least one round of counting is complete. The Delhi Assembly has 70 seats.\nA BJP win would mean the party returns to power in the national capital after 27 years. It would also mean one of the biggest setbacks to the Aam Aadmi Party since it first came to power in Delhi in 2013, effectively changing the national political landscape.\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in"
    },
    {
        "title": "Election Commission of India Delhi Election Results 2025: Check Live vote counting on ECI website results.eci.gov.in, eci.gov.in",
        "link": "https://indianexpress.com/article/india/eci-delhi-election-results-2025-check-live-counting-9824082/?ref=latestnews_hp",
        "content": "Election Commission of India (ECI) Delhi Election Results 2025: All eyes are on Delhi, as the Union Territory braces for the counting of its Assembly poll votes on Saturday. After a fierce competition, the city recorded a voter turnout of 60.44 per cent, slightly lesser than the previous election’s 60.59 per cent. North East Delhi, recorded the highest turnout for the third consecutive time.\nECI Delhi Results 2025: Check Live Counting Here\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in"
    },
    {
        "title": "Delhi Election Results 2025 | As AAP lags and Congress faces rout in Delhi, a jab from Omar: ‘Aur lado’",
        "link": "https://indianexpress.com/elections/delhi-election-results-2025-omar-abdullah-meme-india-alliance-9824270/?ref=latestnews_hp",
        "content": "As results for the Delhi Assembly elections started trickling in, and BJP edged past the halfway mark as per early trends, Jammu and Kashmir Chief Minister Omar Abdullah Saturday took a dig at his INDIA alliance partners.\nThe Aam Aadmi Party, which has a lead in 30 seats in the 70-member Assembly at present, and the Congress decided to go their separate ways in the Delhi polls – a decision that appears to have benefited the BJP.\nIn a post on X alongside a GIF that shows a sadhu saying “Ji bhar kar lado (fight to your heart’s content)”, Omar said, “Aur lado aapas mein!!! (Keep fighting amongst yourselves).”\nSTORY CONTINUES BELOW THIS AD\nThe Chief Minister has been critical of rifts within the alliance earlier too, stating that if the alliance was only for the parliamentary elections, “it should be wound up”.\nHe also underscored that if the alliance is also meant for Assembly elections, “we will have to sit together and work collectively.”\nOmar had made these statements while pointing out that the alliance partners have not convened since the Parliament elections.\nAlthough the parties contested the 2024 Lok Sabha poll together, the AAP and Congress have been critical of each other while contesting the Delhi election, where they have been rivals since AAP’s foray into politics in 2013. During the campaign too, they had frequently traded barbs and targeted each other’s leadership.\nSTORY CONTINUES BELOW THIS AD\nThe Congress and the National Conference are partners in the J&K government. However, Congress has refrained from joining Omar’s cabinet, stating that they will stay out of power in J&K till statehood is restored."
    },
    {
        "title": "Pat Cummins and wife Becky welcome their second child",
        "link": "https://indianexpress.com/article/sports/cricket/pat-cummins-and-wife-becky-welcome-their-second-child-9824287/?ref=latestnews_hp",
        "content": "Australian cricket captain Pat Cummins and his wife Becky have announced their second child, a baby girl named Edith. The Cummins family announced news of their first pregnancy with son Albie on Instagram in 2021.\n“She’s here,” Becky Cummins posted on Instagram with a picture of the newborn. “Our beautiful baby girl, Edi … Words can’t describe how overjoyed & full of love we feel right now.”\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in"
    },
    {
        "title": "Vidaamuyarchi box office collection Day 2: Ajith-Magizh Thirumeni’s film drops to single-digits after major dip, earns Rs 8.75 crore",
        "link": "https://indianexpress.com/article/entertainment/tamil/vidaamuyarchi-box-office-collection-day-2-ajith-magizh-thirumeni-drops-to-single-digits-9824209/?ref=latestnews_hp",
        "content": "Vidaamuyarchi Box Office Collection Day 2: Vidaamuyarchi is far from being a typical star vehicle, and the reviews of the film made a note of this slightly unusual attempt by director Magizh Thirumeni and Ajith Kumar. The film, which opened to Rs 26 crore on day one in the domestic market, dropped by almost 67% to end up with Rs 8.75 crore on day two. Of course, considering it is a working day, the dip was par for the course, but such a drastic drop didn’t happen to other big-ticket films in the recent past, including Suriya’s Kanguva and Kamal Haasan’s Indian 2. Although Vidaamuyarchi did open better than Ajith’s Thunivu, it had a greater fall on day two. However, it is to be noted that Thunivu was a festive release, but it also clashed at the box office with Vijay’s Varisu.\nALSO READ | Ajith Kumar and his spotlight: The Vidaamuyarchi actor finally walks back into it for the racing enthusiast to take centrestage\n"
    }
]